[
   {
      "id": "941",
      "en_ques": "List the former partner of the figure skaters whose former choreographer was Igor Shpillband.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/formerChoreographer> <http://dbpedia.org/resource/Igor_Shpillband> . ?x <http://dbpedia.org/ontology/formerPartner> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FigureSkater>}",
      "entities": [
         "Igor_Shpillband"
      ],
      "relations": [
         "formerChoreographer",
         "formerPartner",
         "FigureSkater"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbo:formerChoreographer dbr:Igor_Shpillband . ?x dbo:formerPartner ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:FigureSkater}"
   },
   {
      "id": "1496",
      "en_ques": "Give me the characters who last appeared in Star Wars Episode 3.",
      "sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/last> <http://dbpedia.org/resource/Star_Wars:_Episode_III_\u2013_Revenge_of_the_Sith> }",
      "entities": [
         "Star_Wars_Episode_III_\u2013_Revenge_of_the_Sith"
      ],
      "relations": [
         "last"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE {?uri dbp:last dbr:Star_Wars:_Episode_III_\u2013_Revenge_of_the_Sith }"
   },
   {
      "id": "2223",
      "en_ques": "Count the drinks originated in England.",
      "sparql": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/origin> <http://dbpedia.org/resource/England>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Beverage>}",
      "entities": [
         "England"
      ],
      "relations": [
         "origin",
         "Beverage"
      ],
      "fil_sparql": "SELECT DISTINCT COUNT(?uri) WHERE {?uri dbo:origin dbr:England  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Beverage}"
   },
   {
      "id": "223",
      "en_ques": "Name the largest city in the county where there is a Cy-Fair High School.",
      "sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cy-Fair_High_School> <http://dbpedia.org/ontology/county> ?x . ?x <http://dbpedia.org/ontology/largestCity> ?uri  . }",
      "entities": [
         "Cy-Fair_High_School"
      ],
      "relations": [
         "county",
         "largestCity"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { dbr:Cy-Fair_High_School dbo:county ?x . ?x dbo:largestCity ?uri  . }"
   },
   {
      "id": "787",
      "en_ques": "List the origin of the weapons which were used in the American Revolutionary War.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/usedInWar> <http://dbpedia.org/resource/American_Revolutionary_War> . ?x <http://dbpedia.org/property/origin> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Weapon>}",
      "entities": [
         "American_Revolutionary_War"
      ],
      "relations": [
         "usedInWar",
         "Weapon",
         "origin"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbo:usedInWar dbr:American_Revolutionary_War . ?x dbp:origin ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Weapon}"
   },
   {
      "id": "2132",
      "en_ques": "Name some shows similar to the one whose theme song is made by Murray Gold.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/themeMusicComposer> <http://dbpedia.org/resource/Murray_Gold> . ?uri <http://dbpedia.org/ontology/related> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
      "entities": [
         "Murray_Gold"
      ],
      "relations": [
         "related",
         "TelevisionShow",
         "themeMusicComposer"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbp:themeMusicComposer dbr:Murray_Gold . ?uri dbo:related ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:TelevisionShow}"
   },
   {
      "id": "4513",
      "en_ques": "To which company is the service 'Nintendo eShop' associated with?",
      "sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/services> <http://dbpedia.org/resource/Nintendo_eShop>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}",
      "entities": [
         "Nintendo_eShop"
      ],
      "relations": [
         "Company",
         "services"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE {?uri dbp:services dbr:Nintendo_eShop  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Company}"
   },
   {
      "id": "3437",
      "en_ques": "Count all the awards which were presented by something located in California.",
      "sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/California> . ?uri <http://dbpedia.org/ontology/presenter> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>}",
      "entities": [
         "California"
      ],
      "relations": [
         "headquarter",
         "presenter",
         "Award"
      ],
      "fil_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x dbo:headquarter dbr:California . ?uri dbo:presenter ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Award}"
   },
   {
      "id": "2512",
      "en_ques": "Name a few who live in a place where Indian English is an official language",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/officialLanguage> <http://dbpedia.org/resource/Indian_English> . ?uri <http://dbpedia.org/ontology/residence> ?x  . }",
      "entities": [
         "Indian_English"
      ],
      "relations": [
         "officialLanguage",
         "residence"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbo:officialLanguage dbr:Indian_English . ?uri dbo:residence ?x  . }"
   },
   {
      "id": "4861",
      "en_ques": "List the people who are in the board of an organization kickstarted in New York.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/foundation> <http://dbpedia.org/resource/New_York> . ?uri <http://dbpedia.org/ontology/board> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}",
      "entities": [
         "New_York"
      ],
      "relations": [
         "board",
         "Person",
         "foundation"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbp:foundation dbr:New_York . ?uri dbo:board ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Person}"
   },
   {
      "id": "793",
      "en_ques": "What sports can be played in Kharghar's schools",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Kharghar> . ?x <http://dbpedia.org/ontology/sport> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/School>}",
      "entities": [
         "Kharghar"
      ],
      "relations": [
         "city",
         "sport",
         "School"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbo:city dbr:Kharghar . ?x dbo:sport ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:School}"
   },
   {
      "id": "1793",
      "en_ques": "Count all the TV shows which are related to the ones produced by Julie Gardner.",
      "sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/executiveProducer> <http://dbpedia.org/resource/Julie_Gardner> . ?uri <http://dbpedia.org/ontology/related> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
      "entities": [
         "Julie_Gardner"
      ],
      "relations": [
         "executiveProducer",
         "related",
         "TelevisionShow"
      ],
      "fil_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x dbo:executiveProducer dbr:Julie_Gardner . ?uri dbo:related ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:TelevisionShow}"
   },
   {
      "id": "561",
      "en_ques": "Name the president served by a lieutenant who succeeded Bob C Riley.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/predecessor> <http://dbpedia.org/resource/Bob_C._Riley> . ?uri <http://dbpedia.org/ontology/lieutenant> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/President>}",
      "entities": [
         "Bob_C._Riley"
      ],
      "relations": [
         "lieutenant",
         "President",
         "predecessor"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbp:predecessor dbr:Bob_C._Riley . ?uri dbo:lieutenant ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:President}"
   },
   {
      "id": "2265",
      "en_ques": "In which movies has momoko kochi acted",
      "sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/starring> <http://dbpedia.org/resource/Momoko_K\u014dchi> }",
      "entities": [
         "Momoko_K\u014dchi"
      ],
      "relations": [
         "starring"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE {?uri dbp:starring dbr:Momoko_K\u014dchi }"
   },
   {
      "id": "2667",
      "en_ques": "Which silver medalist of the Tennis at the 2012 Summer Olympics Men's singles was also the flagbearer of Switzerland at the 2008 Summer Olympics",
      "sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Tennis_at_the_2012_Summer_Olympics_\u2013_Men's_singles> <http://dbpedia.org/ontology/silverMedalist> ?uri. <http://dbpedia.org/resource/Switzerland_at_the_2008_Summer_Olympics> <http://dbpedia.org/property/flagbearer> ?uri}",
      "entities": [
         "Tennis_at_the_2012_Summer_Olympics_\u2013_Men's_singles",
         "Switzerland_at_the_2008_Summer_Olympics"
      ],
      "relations": [
         "silverMedalist",
         "flagbearer"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { dbr:Tennis_at_the_2012_Summer_Olympics_\u2013_Men's_singles dbo:silverMedalist ?uri. dbr:Switzerland_at_the_2008_Summer_Olympics dbp:flagbearer ?uri}"
   },
   {
      "id": "1210",
      "en_ques": "List the shows whose network is run by BBC.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/owningCompany> <http://dbpedia.org/resource/BBC> . ?uri <http://dbpedia.org/ontology/network> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
      "entities": [
         "BBC"
      ],
      "relations": [
         "owningCompany",
         "network",
         "TelevisionShow"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbo:owningCompany dbr:BBC . ?uri dbo:network ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:TelevisionShow}"
   },
   {
      "id": "4620",
      "en_ques": "List the birth city of the politicians of Democratic Party.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/party> <http://dbpedia.org/resource/Democratic_Party_(United_States)> . ?x <http://dbpedia.org/ontology/birthPlace> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>}",
      "entities": [
         "Democratic_Party_(United_States)"
      ],
      "relations": [
         "party",
         "birthPlace",
         "Politician"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbo:party dbr:Democratic_Party_(United_States) . ?x dbo:birthPlace ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Politician}"
   },
   {
      "id": "1379",
      "en_ques": "List the television shows whose network's executive officer is Steve Burke.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/keyPerson> <http://dbpedia.org/resource/Steve_Burke_(businessman)> . ?uri <http://dbpedia.org/ontology/network> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
      "entities": [
         "Steve_Burke_(businessman)"
      ],
      "relations": [
         "keyPerson",
         "network",
         "TelevisionShow"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbo:keyPerson dbr:Steve_Burke_(businessman) . ?uri dbo:network ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:TelevisionShow}"
   },
   {
      "id": "250",
      "en_ques": "List the cast member of the movies whose producer is Mark Johnson.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Mark_Johnson_(producer)> . ?x <http://dbpedia.org/ontology/starring> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}",
      "entities": [
         "Mark_Johnson_(producer)"
      ],
      "relations": [
         "producer",
         "starring",
         "Film"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbo:producer dbr:Mark_Johnson_(producer) . ?x dbo:starring ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Film}"
   },
   {
      "id": "1823",
      "en_ques": "List the debut team of the baseball player who born in Houston.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/birthPlace> <http://dbpedia.org/resource/Houston> . ?x <http://dbpedia.org/ontology/debutTeam> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BaseballPlayer>}",
      "entities": [
         "Houston"
      ],
      "relations": [
         "debutTeam",
         "BaseballPlayer",
         "birthPlace"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbp:birthPlace dbr:Houston . ?x dbo:debutTeam ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:BaseballPlayer}"
   },
   {
      "id": "1218",
      "en_ques": "List the movies whose cast member were born in Scotland.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Scotland> . ?uri <http://dbpedia.org/ontology/starring> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}",
      "entities": [
         "Scotland"
      ],
      "relations": [
         "birthPlace",
         "starring",
         "Film"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbo:birthPlace dbr:Scotland . ?uri dbo:starring ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Film}"
   },
   {
      "id": "1442",
      "en_ques": "List the mascot of the universities which are a part of National Collegiate Athletic Association.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/athletics> <http://dbpedia.org/resource/National_Collegiate_Athletic_Association> . ?x <http://dbpedia.org/property/mascot> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>}",
      "entities": [
         "National_Collegiate_Athletic_Association"
      ],
      "relations": [
         "University",
         "athletics",
         "mascot"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbp:athletics dbr:National_Collegiate_Athletic_Association . ?x dbp:mascot ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:University}"
   },
   {
      "id": "2267",
      "en_ques": "Where can i find teams whose coach has been Rodney Eade.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/coach> <http://dbpedia.org/resource/Rodney_Eade> . ?x <http://dbpedia.org/property/location> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsTeam>}",
      "entities": [
         "Rodney_Eade"
      ],
      "relations": [
         "SportsTeam",
         "coach",
         "location"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbp:coach dbr:Rodney_Eade . ?x dbp:location ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:SportsTeam}"
   },
   {
      "id": "129",
      "en_ques": "What newspapers's owners is Schibsted",
      "sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/owners> <http://dbpedia.org/resource/Schibsted>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Newspaper>}",
      "entities": [
         "Schibsted"
      ],
      "relations": [
         "Newspaper",
         "owners"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE {?uri dbp:owners dbr:Schibsted  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Newspaper}"
   },
   {
      "id": "458",
      "en_ques": "Count the different origins of members of the Vitis Vinifera species.",
      "sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/species> <http://dbpedia.org/resource/Vitis_vinifera> . ?x <http://dbpedia.org/ontology/origin> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>}",
      "entities": [
         "Vitis_vinifera"
      ],
      "relations": [
         "species",
         "origin",
         "Place"
      ],
      "fil_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x dbo:species dbr:Vitis_vinifera . ?x dbo:origin ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Place}"
   },
   {
      "id": "339",
      "en_ques": "List the newspapers whose headquarters's time zone is Central European Summer Time.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/timeZone> <http://dbpedia.org/resource/Central_European_Summer_Time> . ?uri <http://dbpedia.org/property/headquarters> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Newspaper>}",
      "entities": [
         "Central_European_Summer_Time"
      ],
      "relations": [
         "timeZone",
         "Newspaper",
         "headquarters"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbo:timeZone dbr:Central_European_Summer_Time . ?uri dbp:headquarters ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Newspaper}"
   },
   {
      "id": "1329",
      "en_ques": "List the agencies located someplace lead by Alex Chalk.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/leaderName> <http://dbpedia.org/resource/Alex_Chalk> . ?uri <http://dbpedia.org/ontology/location> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/GovernmentAgency>}",
      "entities": [
         "Alex_Chalk"
      ],
      "relations": [
         "leaderName",
         "location",
         "GovernmentAgency"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbo:leaderName dbr:Alex_Chalk . ?uri dbo:location ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:GovernmentAgency}"
   },
   {
      "id": "4446",
      "en_ques": "Give me a list of all the buildings which are located in districts governed by John Tory.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/leaderName> <http://dbpedia.org/resource/John_Tory> . ?uri <http://dbpedia.org/ontology/location> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>}",
      "entities": [
         "John_Tory"
      ],
      "relations": [
         "location",
         "Building",
         "leaderName"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbp:leaderName dbr:John_Tory . ?uri dbo:location ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Building}"
   },
   {
      "id": "2671",
      "en_ques": "List the birthplace of the medicians who studied in Harvard.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/institution> <http://dbpedia.org/resource/Harvard_Medical_School> . ?x <http://dbpedia.org/ontology/birthPlace> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Medician>}",
      "entities": [
         "Harvard_Medical_School"
      ],
      "relations": [
         "institution",
         "birthPlace",
         "Medician"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbo:institution dbr:Harvard_Medical_School . ?x dbo:birthPlace ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Medician}"
   },
   {
      "id": "3533",
      "en_ques": "Which movies's screenplay is written by Akiva Goldsman",
      "sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/screenplay> <http://dbpedia.org/resource/Akiva_Goldsman>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}",
      "entities": [
         "Akiva_Goldsman"
      ],
      "relations": [
         "Film",
         "screenplay"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE {?uri dbp:screenplay dbr:Akiva_Goldsman  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Film}"
   },
   {
      "id": "4015",
      "en_ques": "Where is the mouth of the river whose tributary is Bjelimi\u0107ka  Rijeka ?",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/rightTributary> <http://dbpedia.org/resource/Bjelimi\u0107ka_Rijeka> . ?x <http://dbpedia.org/ontology/mouthCountry> ?uri  . }",
      "entities": [
         "Bjelimi\u0107ka_Rijeka"
      ],
      "relations": [
         "rightTributary",
         "mouthCountry"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbo:rightTributary dbr:Bjelimi\u0107ka_Rijeka . ?x dbo:mouthCountry ?uri  . }"
   },
   {
      "id": "125",
      "en_ques": "Count all the different purposes followed by the different NGOs.",
      "sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/type> <http://dbpedia.org/resource/Non-governmental_organization> . ?x <http://dbpedia.org/property/purpose> ?uri  . }",
      "entities": [
         "Non-governmental_organization"
      ],
      "relations": [
         "type",
         "purpose"
      ],
      "fil_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x dbp:type dbr:Non-governmental_organization . ?x dbp:purpose ?uri  . }"
   },
   {
      "id": "991",
      "en_ques": "What are some apes?",
      "sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/family> <http://dbpedia.org/resource/Ape>  . }",
      "entities": [
         "Ape"
      ],
      "relations": [
         "family"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE {?uri dbo:family dbr:Ape  . }"
   },
   {
      "id": "3670",
      "en_ques": "List the producer of the TV shows whose company is HBO.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/company> <http://dbpedia.org/resource/HBO> . ?x <http://dbpedia.org/ontology/producer> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
      "entities": [
         "HBO"
      ],
      "relations": [
         "company",
         "producer",
         "TelevisionShow"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbo:company dbr:HBO . ?x dbo:producer ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:TelevisionShow}"
   },
   {
      "id": "4150",
      "en_ques": "What sports team's arena is The Palace of Auburn Hills",
      "sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/arena> <http://dbpedia.org/resource/The_Palace_of_Auburn_Hills>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsTeam>}",
      "entities": [
         "The_Palace_of_Auburn_Hills"
      ],
      "relations": [
         "SportsTeam",
         "arena"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE {?uri dbp:arena dbr:The_Palace_of_Auburn_Hills  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:SportsTeam}"
   },
   {
      "id": "1484",
      "en_ques": "List the television shows whose network's sister names is N-tv.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/sisterNames> <http://dbpedia.org/resource/N-tv> . ?uri <http://dbpedia.org/property/network> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
      "entities": [
         "N-tv"
      ],
      "relations": [
         "TelevisionShow",
         "sisterNames",
         "network"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbp:sisterNames dbr:N-tv . ?uri dbp:network ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:TelevisionShow}"
   },
   {
      "id": "2618",
      "en_ques": "List the series of the books whose author is K. W. Jeter.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/author> <http://dbpedia.org/resource/K._W._Jeter> . ?x <http://dbpedia.org/ontology/series> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>}",
      "entities": [
         "K._W._Jeter"
      ],
      "relations": [
         "series",
         "Book",
         "author"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbp:author dbr:K._W._Jeter . ?x dbo:series ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Book}"
   },
   {
      "id": "1310",
      "en_ques": "Name some dishes made with flowering plants.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/division> <http://dbpedia.org/resource/Flowering_plant> . ?uri <http://dbpedia.org/ontology/ingredient> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Food>}",
      "entities": [
         "Flowering_plant"
      ],
      "relations": [
         "division",
         "ingredient",
         "Food"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbo:division dbr:Flowering_plant . ?uri dbo:ingredient ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Food}"
   },
   {
      "id": "2427",
      "en_ques": "Count all the stateless people.",
      "sparql": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/citizenship> <http://dbpedia.org/resource/Statelessness>  . }",
      "entities": [
         "Statelessness"
      ],
      "relations": [
         "citizenship"
      ],
      "fil_sparql": "SELECT DISTINCT COUNT(?uri) WHERE {?uri dbo:citizenship dbr:Statelessness  . }"
   },
   {
      "id": "3061",
      "en_ques": "Count the journals in the field of Philosophy.",
      "sparql": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/property/discipline> <http://dbpedia.org/resource/Philosophy>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AcademicJournal>}",
      "entities": [
         "Philosophy"
      ],
      "relations": [
         "AcademicJournal",
         "discipline"
      ],
      "fil_sparql": "SELECT DISTINCT COUNT(?uri) WHERE {?uri dbp:discipline dbr:Philosophy  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:AcademicJournal}"
   },
   {
      "id": "1500",
      "en_ques": "Name the movie with narrator as Trevor Peacock and music composer as Christophe Beck.",
      "sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/narrator> <http://dbpedia.org/resource/Trevor_Peacock> . ?uri <http://dbpedia.org/property/music> <http://dbpedia.org/resource/Christophe_Beck>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}",
      "entities": [
         "Trevor_Peacock",
         "Christophe_Beck"
      ],
      "relations": [
         "Film",
         "narrator",
         "music"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE {?uri dbp:narrator dbr:Trevor_Peacock . ?uri dbp:music dbr:Christophe_Beck  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Film}"
   },
   {
      "id": "4694",
      "en_ques": "Which television show is based in Massachusetts and has opening theme as 'Where Everybody Knows Your Name' ?",
      "sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/openingTheme> <http://dbpedia.org/resource/Where_Everybody_Knows_Your_Name> . ?uri <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Massachusetts>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
      "entities": [
         "Where_Everybody_Knows_Your_Name",
         "Massachusetts"
      ],
      "relations": [
         "openingTheme",
         "location",
         "TelevisionShow"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE {?uri dbo:openingTheme dbr:Where_Everybody_Knows_Your_Name . ?uri dbo:location dbr:Massachusetts  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:TelevisionShow}"
   },
   {
      "id": "3320",
      "en_ques": "Count the awards won by the people who graduated from the National and Kapodistrian University of Athens.",
      "sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/National_and_Kapodistrian_University_of_Athens> . ?x <http://dbpedia.org/ontology/award> ?uri  . }",
      "entities": [
         "National_and_Kapodistrian_University_of_Athens"
      ],
      "relations": [
         "almaMater",
         "award"
      ],
      "fil_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x dbo:almaMater dbr:National_and_Kapodistrian_University_of_Athens . ?x dbo:award ?uri  . }"
   },
   {
      "id": "131",
      "en_ques": "List the name of the soccer clubs whose chairman is Joan Laporta.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/chairman> <http://dbpedia.org/resource/Joan_Laporta> . ?x <http://dbpedia.org/property/name> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub>}",
      "entities": [
         "Joan_Laporta"
      ],
      "relations": [
         "chairman",
         "SoccerClub",
         "name"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbo:chairman dbr:Joan_Laporta . ?x dbp:name ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:SoccerClub}"
   },
   {
      "id": "29",
      "en_ques": "Who is the common manager of Aston Villa 2000-01 season and also the manager of Middlesbrough F.C. season 2009-10",
      "sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2000\u201301_Aston_Villa_F.C._season> <http://dbpedia.org/property/name> ?uri. <http://dbpedia.org/resource/2009\u201310_Middlesbrough_F.C._season> <http://dbpedia.org/ontology/manager> ?uri}",
      "entities": [
         "2000\u201301_Aston_Villa_F.C._season",
         "2009\u201310_Middlesbrough_F.C._season"
      ],
      "relations": [
         "manager",
         "name"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { dbr:2000\u201301_Aston_Villa_F.C._season dbp:name ?uri. dbr:2009\u201310_Middlesbrough_F.C._season dbo:manager ?uri}"
   }
]