[
   {
      "id": "170",
      "en_ques": "Count the number of people who graduated from universities affiliated with the NCAA.",
      "sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/athletics> <http://dbpedia.org/resource/National_Collegiate_Athletic_Association> . ?uri <http://dbpedia.org/property/education> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}",
      "entities": [
         "National_Collegiate_Athletic_Association"
      ],
      "relations": [
         "athletics",
         "Person",
         "education"
      ],
      "fil_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x dbo:athletics dbr:National_Collegiate_Athletic_Association . ?uri dbp:education ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Person}"
   },
   {
      "id": "385",
      "en_ques": "Count the units garrisoned at Arlington County, Virginia.",
      "sparql": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/garrison> <http://dbpedia.org/resource/Arlington_County,_Virginia>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryUnit>}",
      "entities": [
         "Arlington_County,_Virginia"
      ],
      "relations": [
         "garrison",
         "MilitaryUnit"
      ],
      "fil_sparql": "SELECT DISTINCT COUNT(?uri) WHERE {?uri dbo:garrison dbr:Arlington_County,_Virginia  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:MilitaryUnit}"
   },
   {
      "id": "3304",
      "en_ques": "List the universities from a country where Norwegian language is officially accepted.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/officialLanguage> <http://dbpedia.org/resource/Norwegian_language> . ?uri <http://dbpedia.org/ontology/country> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>}",
      "entities": [
         "Norwegian_language"
      ],
      "relations": [
         "officialLanguage",
         "country",
         "University"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbo:officialLanguage dbr:Norwegian_language . ?uri dbo:country ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:University}"
   },
   {
      "id": "3424",
      "en_ques": "List the resting place of the people who served in Norwalk Trainband.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/militaryUnit> <http://dbpedia.org/resource/Norwalk_Trainband> . ?x <http://dbpedia.org/property/restingplace> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}",
      "entities": [
         "Norwalk_Trainband"
      ],
      "relations": [
         "militaryUnit",
         "Person",
         "restingplace"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbo:militaryUnit dbr:Norwalk_Trainband . ?x dbp:restingplace ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Person}"
   },
   {
      "id": "1739",
      "en_ques": "Give me some software which run on mac os.",
      "sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/operatingSystem> <http://dbpedia.org/resource/Mac_OS>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>}",
      "entities": [
         "Mac_OS"
      ],
      "relations": [
         "operatingSystem",
         "Software"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE {?uri dbo:operatingSystem dbr:Mac_OS  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Software}"
   },
   {
      "id": "2619",
      "en_ques": "List the authors of the musicals whose songwriter is Richard M. Sherman.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Richard_M._Sherman> . ?x <http://dbpedia.org/ontology/author> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>}",
      "entities": [
         "Richard_M._Sherman"
      ],
      "relations": [
         "musicBy",
         "author",
         "Musical"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbo:musicBy dbr:Richard_M._Sherman . ?x dbo:author ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Musical}"
   },
   {
      "id": "1110",
      "en_ques": "Count the territories of the wars where the QF Hotchkiss was used.",
      "sparql": "SELECT DISTINCT COUNT(?uri) WHERE { <http://dbpedia.org/resource/QF_6-pounder_Hotchkiss> <http://dbpedia.org/ontology/usedInWar> ?x . ?x <http://dbpedia.org/ontology/territory> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>}",
      "entities": [
         "QF_6-pounder_Hotchkiss"
      ],
      "relations": [
         "usedInWar",
         "territory",
         "MilitaryConflict"
      ],
      "fil_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { dbr:QF_6-pounder_Hotchkiss dbo:usedInWar ?x . ?x dbo:territory ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:MilitaryConflict}"
   },
   {
      "id": "3172",
      "en_ques": "Give me the count of artist in the company whose Artist is Jean- Fran\u00e7ois Cot\u00e9 ?",
      "sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/artist> <http://dbpedia.org/resource/Jean-Fran\u00e7ois_Cot\u00e9> . ?x <http://dbpedia.org/property/artist> ?uri }",
      "entities": [
         "Jean-Fran\u00e7ois_Cot\u00e9"
      ],
      "relations": [
         "artist",
         "artist"
      ],
      "fil_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x dbp:artist dbr:Jean-Fran\u00e7ois_Cot\u00e9 . ?x dbp:artist ?uri }"
   },
   {
      "id": "1679",
      "en_ques": "List the producers of the television shows distributed by FremantleMedia.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/distributor> <http://dbpedia.org/resource/FremantleMedia> . ?x <http://dbpedia.org/ontology/producer> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
      "entities": [
         "FremantleMedia"
      ],
      "relations": [
         "producer",
         "TelevisionShow",
         "distributor"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbp:distributor dbr:FremantleMedia . ?x dbo:producer ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:TelevisionShow}"
   },
   {
      "id": "105",
      "en_ques": "List the movies whose editors are born in London.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/placeOfBirth> <http://dbpedia.org/resource/London> . ?uri <http://dbpedia.org/ontology/editing> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}",
      "entities": [
         "London"
      ],
      "relations": [
         "editing",
         "Film",
         "placeOfBirth"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbp:placeOfBirth dbr:London . ?uri dbo:editing ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Film}"
   },
   {
      "id": "3748",
      "en_ques": "Where is the headquarters of Sigma TV",
      "sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Sigma_TV> <http://dbpedia.org/property/headquarters> ?uri }",
      "entities": [
         "Sigma_TV"
      ],
      "relations": [
         "headquarters"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { dbr:Sigma_TV dbp:headquarters ?uri }"
   },
   {
      "id": "1058",
      "en_ques": "What is the official residence of the Christopher Daz Figuero which is also the state of the Cruce a Nado Internacional",
      "sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Christopher_D\u00edaz_Figueroa> <http://dbpedia.org/property/residence> ?uri. <http://dbpedia.org/resource/Cruce_a_Nado_Internacional> <http://dbpedia.org/ontology/country> ?uri}",
      "entities": [
         "Christopher_D\u00edaz_Figueroa",
         "Cruce_a_Nado_Internacional"
      ],
      "relations": [
         "country",
         "residence"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { dbr:Christopher_D\u00edaz_Figueroa dbp:residence ?uri. dbr:Cruce_a_Nado_Internacional dbo:country ?uri}"
   },
   {
      "id": "1260",
      "en_ques": "List the books whose authors are born in Alcal de Henares.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Alcal\u00e1_de_Henares> . ?uri <http://dbpedia.org/ontology/author> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>}",
      "entities": [
         "Alcal\u00e1_de_Henares"
      ],
      "relations": [
         "birthPlace",
         "author",
         "Book"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbo:birthPlace dbr:Alcal\u00e1_de_Henares . ?uri dbo:author ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Book}"
   },
   {
      "id": "1981",
      "en_ques": "Give me the count of all the names of characters created by Frank Miller",
      "sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/creators> <http://dbpedia.org/resource/Frank_Miller_(comics)> . ?x <http://dbpedia.org/property/characterName> ?uri  . }",
      "entities": [
         "Frank_Miller_(comics)"
      ],
      "relations": [
         "creators",
         "characterName"
      ],
      "fil_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x dbp:creators dbr:Frank_Miller_(comics) . ?x dbp:characterName ?uri  . }"
   },
   {
      "id": "330",
      "en_ques": "Give me some series related to the one which had Yasmin Paige in them.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/starring> <http://dbpedia.org/resource/Yasmin_Paige> . ?uri <http://dbpedia.org/ontology/related> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
      "entities": [
         "Yasmin_Paige"
      ],
      "relations": [
         "related",
         "TelevisionShow",
         "starring"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbp:starring dbr:Yasmin_Paige . ?uri dbo:related ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:TelevisionShow}"
   },
   {
      "id": "3052",
      "en_ques": "List the academic discipline of the journals whose publisher is SAGE Publications.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/publisher> <http://dbpedia.org/resource/SAGE_Publications> . ?x <http://dbpedia.org/ontology/academicDiscipline> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AcademicJournal>}",
      "entities": [
         "SAGE_Publications"
      ],
      "relations": [
         "academicDiscipline",
         "AcademicJournal",
         "publisher"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbp:publisher dbr:SAGE_Publications . ?x dbo:academicDiscipline ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:AcademicJournal}"
   },
   {
      "id": "1651",
      "en_ques": "List the first drivers of Grand Prixes where Mika Hakkinen was a pole driver.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/poleDriver> <http://dbpedia.org/resource/Mika_H\u00e4kkinen> . ?x <http://dbpedia.org/ontology/firstDriver> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/GrandPrix>}",
      "entities": [
         "Mika_H\u00e4kkinen"
      ],
      "relations": [
         "poleDriver",
         "firstDriver",
         "GrandPrix"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbo:poleDriver dbr:Mika_H\u00e4kkinen . ?x dbo:firstDriver ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:GrandPrix}"
   },
   {
      "id": "3608",
      "en_ques": "Count all the shows whose music composers are in Oysterhead.",
      "sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/associatedMusicalArtist> <http://dbpedia.org/resource/Oysterhead> . ?uri <http://dbpedia.org/property/themeMusicComposer> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
      "entities": [
         "Oysterhead"
      ],
      "relations": [
         "associatedMusicalArtist",
         "TelevisionShow",
         "themeMusicComposer"
      ],
      "fil_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x dbo:associatedMusicalArtist dbr:Oysterhead . ?uri dbp:themeMusicComposer ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:TelevisionShow}"
   },
   {
      "id": "445",
      "en_ques": "What is the death place of the Elbieta Czartoryska which is also place of birth of the Charles Journet",
      "sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/El\u017cbieta_Czartoryska_(1905\u20131989)> <http://dbpedia.org/property/deathPlace> ?uri. <http://dbpedia.org/resource/Charles_Journet> <http://dbpedia.org/ontology/birthPlace> ?uri}",
      "entities": [
         "El\u017cbieta_Czartoryska_(1905\u20131989)",
         "Charles_Journet"
      ],
      "relations": [
         "birthPlace",
         "deathPlace"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { dbr:El\u017cbieta_Czartoryska_(1905\u20131989) dbp:deathPlace ?uri. dbr:Charles_Journet dbo:birthPlace ?uri}"
   },
   {
      "id": "4570",
      "en_ques": "List some writers which speak one of the Germanic languages.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/languageFamily> <http://dbpedia.org/resource/Germanic_languages> . ?uri <http://dbpedia.org/property/language> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>}",
      "entities": [
         "Germanic_languages"
      ],
      "relations": [
         "languageFamily",
         "Writer",
         "language"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbo:languageFamily dbr:Germanic_languages . ?uri dbp:language ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Writer}"
   },
   {
      "id": "1254",
      "en_ques": "List the served region of the organisations of Trade association.",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/Trade_association> . ?x <http://dbpedia.org/ontology/regionServed> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Organisation>}",
      "entities": [
         "Trade_association"
      ],
      "relations": [
         "type",
         "regionServed",
         "Organisation"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbo:type dbr:Trade_association . ?x dbo:regionServed ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Organisation}"
   }
]