[
   {
      "id": "1",
      "en_ques": "list all boardgames by gmt.",
      "en_key": "boardgame, gmt",
      "de_ques": "liste alle brettspiele von gmt. ",
      "de_key": "brettspiel ,  gmt",
      "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }",
      "entities": [
         "GMT_Games"
      ],
      "relations": [
         "publisher"
      ],
      "fil_sparql": "SELECT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }",
      "question": "list all boardgames by gmt.",
      "question_pos_tokens": [
         "NOUN",
         "NOUN",
         "PROPN",
         "NOUN",
         "NOUN",
         "PRON",
         "PROPN",
         "PUNCT"
      ],
      "question_pos_ids": [
         1,
         1,
         2,
         1,
         1,
         3,
         2,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "det",
         "dobj",
         "dobj",
         "prep",
         "pobj",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         3,
         2,
         2,
         2,
         4,
         4,
         2
      ],
      "mapping": {
         "0": {
            "token": "list",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "2": {
            "token": "board",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "3": {
            "token": "games",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "by",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 2
         },
         "5": {
            "token": "g",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "6": {
            "token": "mt",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "7": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "9",
      "en_ques": "give me all actors starring in movies directed by and starring william shatner.",
      "en_key": "actor, starring, movie, direct, starring, william shatner",
      "de_ques": "gib mir alle schauspieler von filmen, in denen william shatner sowohl regie gef\u00fchrt als auch selber mitgespielt hat.",
      "de_key": "film, schauspieler, regie, mitspielen, william shatner",
      "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner ; dbo:starring res:William_Shatner { ?x dbo:starring ?uri } UNION { ?x dbp:starring ?uri } }",
      "entities": [
         "William_Shatner",
         "William_Shatner"
      ],
      "relations": [
         "director",
         "starring",
         "starring",
         "starring"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner ; dbo:starring res:William_Shatner { ?x dbo:starring ?uri } UNION { ?x dbp:starring ?uri } }",
      "question": "give me all actors starring in movies directed by and starring william shatner.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "VERB",
         "NOUN",
         "NOUN",
         "VERB",
         "NOUN",
         "NOUN",
         "VERB",
         "NOUN",
         "PROPN",
         "PROPN",
         "ADP",
         "PROPN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         7,
         1,
         1,
         7,
         1,
         1,
         7,
         1,
         2,
         2,
         6,
         2,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "dobj",
         "acl",
         "prep",
         "pobj",
         "acl",
         "agent",
         "cc",
         "conj",
         "compound",
         "compound",
         "dobj",
         "dobj",
         "dobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         2,
         3,
         4,
         5,
         6,
         7,
         7,
         7,
         9,
         9,
         8,
         8,
         8,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "actors",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "starring",
            "pos": "VERB",
            "dep-tok": "acl",
            "dep-lvl": 3
         },
         "5": {
            "token": "in",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 4
         },
         "6": {
            "token": "movies",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "7": {
            "token": "directed",
            "pos": "VERB",
            "dep-tok": "acl",
            "dep-lvl": 6
         },
         "8": {
            "token": "by",
            "pos": "ADP",
            "dep-tok": "agent",
            "dep-lvl": 7
         },
         "9": {
            "token": "and",
            "pos": "CCONJ",
            "dep-tok": "cc",
            "dep-lvl": 7
         },
         "10": {
            "token": "starring",
            "pos": "VERB",
            "dep-tok": "conj",
            "dep-lvl": 7
         },
         "11": {
            "token": "will",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 9
         },
         "12": {
            "token": "iam",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 9
         },
         "13": {
            "token": "sh",
            "pos": "PROPN",
            "dep-tok": "dobj",
            "dep-lvl": 8
         },
         "14": {
            "token": "at",
            "pos": "PROPN",
            "dep-tok": "dobj",
            "dep-lvl": 8
         },
         "15": {
            "token": "ner",
            "pos": "PROPN",
            "dep-tok": "dobj",
            "dep-lvl": 8
         },
         "16": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "11",
      "en_ques": "give me all danish films.",
      "en_key": "film, denmark",
      "de_ques": "gib mir alle d\u00e4nischen filme.",
      "de_key": "film, d\u00e4nemark",
      "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:country res:Denmark }",
      "entities": [
         "Denmark"
      ],
      "relations": [
         "Film",
         "country"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:country res:Denmark }",
      "question": "give me all danish films.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "PROPN",
         "NOUN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         2,
         1,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "amod",
         "amod",
         "dobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         3,
         3,
         2,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "d",
            "pos": "ADJ",
            "dep-tok": "amod",
            "dep-lvl": 3
         },
         "4": {
            "token": "anish",
            "pos": "ADJ",
            "dep-tok": "amod",
            "dep-lvl": 3
         },
         "5": {
            "token": "films",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "6": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "13",
      "en_ques": "give me the grandchildren of bruce lee.",
      "en_key": "bruce lee, grandchildren",
      "de_ques": "gib mir die enkel von bruce lee.",
      "de_key": "bruce lee, enkel",
      "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Bruce_Lee dbo:child ?child . ?child <http://dbpedia.org/property/children> ?uri }",
      "entities": [
         "Bruce_Lee"
      ],
      "relations": [
         "children",
         "child"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { res:Bruce_Lee dbo:child ?child . ?child dbp:children ?uri }",
      "question": "give me the grandchildren of bruce lee.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "PROPN",
         "NOUN",
         "X",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         1,
         1,
         2,
         1,
         5,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "dobj",
         "prep",
         "compound",
         "compound",
         "pobj",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         2,
         3,
         5,
         5,
         4,
         4,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "the",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "grandchildren",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "of",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 3
         },
         "5": {
            "token": "bru",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 5
         },
         "6": {
            "token": "ce",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 5
         },
         "7": {
            "token": "le",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "8": {
            "token": "e",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "9": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "20",
      "en_ques": "give me the apollo 14 astronauts.",
      "en_key": "astronaut, apollo 14",
      "de_ques": "gib mir alle apollo-14-astronauten.",
      "de_key": "astronaut, apollo 14",
      "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:mission res:Apollo_14 }",
      "entities": [
         "Apollo_14"
      ],
      "relations": [
         "mission"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri dbo:mission res:Apollo_14 }",
      "question": "give me the apollo 14 astronauts.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "PROPN",
         "PROPN",
         "NOUN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         2,
         2,
         1,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "nmod",
         "nmod",
         "nummod",
         "dobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         4,
         4,
         4,
         3,
         2,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "the",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 4
         },
         "3": {
            "token": "ap",
            "pos": "PROPN",
            "dep-tok": "nmod",
            "dep-lvl": 4
         },
         "4": {
            "token": "ollo",
            "pos": "PROPN",
            "dep-tok": "nmod",
            "dep-lvl": 4
         },
         "5": {
            "token": "14",
            "pos": "NUM",
            "dep-tok": "nummod",
            "dep-lvl": 3
         },
         "6": {
            "token": "astronauts",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "7": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "24",
      "en_ques": "give me a list of all trumpet players that were bandleaders.",
      "en_key": "trumpet player, bandleader",
      "de_ques": "gib mit eine liste aller trompeter, die bandleader waren.",
      "de_key": "trompeter, bandleader",
      "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:occupation res:Bandleader ; dbo:instrument res:Trumpet }",
      "entities": [
         "Bandleader",
         "Trumpet"
      ],
      "relations": [
         "occupation",
         "instrument"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri dbo:occupation res:Bandleader ; dbo:instrument res:Trumpet }",
      "question": "give me a list of all trumpet players that were bandleaders.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "PROPN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "PROPN",
         "NOUN",
         "NOUN",
         "NOUN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         2,
         1,
         1,
         1,
         1,
         1,
         2,
         1,
         1,
         1,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "dobj",
         "prep",
         "det",
         "compound",
         "pobj",
         "nsubj",
         "relcl",
         "attr",
         "attr",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         2,
         3,
         5,
         5,
         4,
         6,
         5,
         6,
         6,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "a",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "list",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "of",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 3
         },
         "5": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 5
         },
         "6": {
            "token": "trumpet",
            "pos": "NOUN",
            "dep-tok": "compound",
            "dep-lvl": 5
         },
         "7": {
            "token": "players",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "8": {
            "token": "that",
            "pos": "PRON",
            "dep-tok": "nsubj",
            "dep-lvl": 6
         },
         "9": {
            "token": "were",
            "pos": "AUX",
            "dep-tok": "relcl",
            "dep-lvl": 5
         },
         "10": {
            "token": "band",
            "pos": "NOUN",
            "dep-tok": "attr",
            "dep-lvl": 6
         },
         "11": {
            "token": "leaders",
            "pos": "NOUN",
            "dep-tok": "attr",
            "dep-lvl": 6
         },
         "12": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "29",
      "en_ques": "show me all museums in london.",
      "en_key": "museums, london",
      "de_ques": "zeig mir alle museen in london.",
      "de_key": "london, museen",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Museum> ; <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/London> }",
      "entities": [
         "London"
      ],
      "relations": [
         "Museum",
         "location"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Museum ; dbo:location dbr:London }",
      "question": "show me all museums in london.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "PROPN",
         "NOUN",
         "NOUN",
         "NOUN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         2,
         1,
         1,
         1,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "dobj",
         "prep",
         "pobj",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         2,
         2,
         4,
         4,
         2
      ],
      "mapping": {
         "0": {
            "token": "show",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "museums",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "in",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 2
         },
         "5": {
            "token": "l",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "6": {
            "token": "ondon",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "7": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "34",
      "en_ques": "show me all basketball players that are higher than 2 meters.",
      "en_key": "basketball players, higher than 2 meters",
      "de_ques": "zeig mir alle basketballspieler, die gr\u00f6\u00dfer als 2 meter sind.",
      "de_key": "basketballspieler, gr\u00f6\u00dfer als 2 meter",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/BasketballPlayer> ; <http://dbpedia.org/ontology/height> ?n FILTER ( ?n > 2.0 ) }",
      "entities": [],
      "relations": [
         "BasketballPlayer",
         "height"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:BasketballPlayer ; dbo:height ?n FILTER ( ?n  2.0 ) }",
      "question": "show me all basketball players that are higher than 2 meters.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "PROPN",
         "NOUN",
         "PROPN",
         "PROPN",
         "ADJ",
         "NOUN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         1,
         2,
         1,
         2,
         2,
         11,
         1,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "compound",
         "compound",
         "dobj",
         "nsubj",
         "relcl",
         "acomp",
         "prep",
         "nummod",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         3,
         2,
         4,
         3,
         4,
         5,
         7,
         6,
         2
      ],
      "mapping": {
         "0": {
            "token": "show",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "NOUN",
            "dep-tok": "compound",
            "dep-lvl": 3
         },
         "3": {
            "token": "basketball",
            "pos": "NOUN",
            "dep-tok": "compound",
            "dep-lvl": 3
         },
         "4": {
            "token": "players",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "5": {
            "token": "that",
            "pos": "PRON",
            "dep-tok": "nsubj",
            "dep-lvl": 4
         },
         "6": {
            "token": "are",
            "pos": "AUX",
            "dep-tok": "relcl",
            "dep-lvl": 3
         },
         "7": {
            "token": "higher",
            "pos": "ADJ",
            "dep-tok": "acomp",
            "dep-lvl": 4
         },
         "8": {
            "token": "than",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 5
         },
         "9": {
            "token": "2",
            "pos": "NUM",
            "dep-tok": "nummod",
            "dep-lvl": 7
         },
         "10": {
            "token": "meters",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 6
         },
         "11": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "40",
      "en_ques": "give all swimmers that were born in moscow.",
      "en_key": "swimmer, born, moscow",
      "de_ques": "zeig mir alle schwimmer, die in moskau geboren wurden.",
      "de_key": "schwimmer, geboren in, moskau",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Swimmer> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Moscow> }",
      "entities": [
         "Moscow"
      ],
      "relations": [
         "Swimmer",
         "birthPlace"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Swimmer ; dbo:birthPlace dbr:Moscow }",
      "question": "give all swimmers that were born in moscow.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "PROPN",
         "NOUN",
         "PROPN",
         "NOUN",
         "PROPN",
         "NOUN",
         "PROPN",
         "NOUN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         2,
         1,
         2,
         1,
         2,
         1,
         2,
         1,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "det",
         "dobj",
         "dobj",
         "nsubjpass",
         "auxpass",
         "relcl",
         "prep",
         "pobj",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         3,
         2,
         2,
         4,
         4,
         3,
         4,
         5,
         5,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "2": {
            "token": "sw",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "3": {
            "token": "immers",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "that",
            "pos": "PRON",
            "dep-tok": "nsubjpass",
            "dep-lvl": 4
         },
         "5": {
            "token": "were",
            "pos": "AUX",
            "dep-tok": "auxpass",
            "dep-lvl": 4
         },
         "6": {
            "token": "born",
            "pos": "VERB",
            "dep-tok": "relcl",
            "dep-lvl": 3
         },
         "7": {
            "token": "in",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 4
         },
         "8": {
            "token": "mos",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "9": {
            "token": "cow",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "10": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "41",
      "en_ques": "give me all cosmonauts.",
      "en_key": "cosmonauts",
      "de_ques": "gib mir alle kosmonauten.",
      "de_key": "kosmonauten",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Astronaut> { ?uri <http://dbpedia.org/ontology/nationality> <http://dbpedia.org/resource/Russia> } UNION { ?uri <http://dbpedia.org/ontology/nationality> <http://dbpedia.org/resource/Soviet_Union> } }",
      "entities": [
         "Russia",
         "Soviet_Union"
      ],
      "relations": [
         "Astronaut",
         "nationality",
         "nationality"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Astronaut { ?uri dbo:nationality dbr:Russia } UNION { ?uri dbo:nationality dbr:Soviet_Union } }",
      "question": "give me all cosmonauts.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "PROPN",
         "PROPN",
         "NOUN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         2,
         2,
         1,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "dobj",
         "dobj",
         "dobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         2,
         2,
         2,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "cos",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "mon",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "5": {
            "token": "auts",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "6": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   }
]