[
   {
      "id": "73",
      "en_ques": "give me all esa astronauts.",
      "en_key": "esa astronauts",
      "de_ques": "gib mir alle esa-astronauten.",
      "de_key": "esa-astronauten",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Astronaut> ; <http://dbpedia.org/property/type> <http://dbpedia.org/resource/European_Space_Agency> }",
      "entities": [
         "European_Space_Agency"
      ],
      "relations": [
         "Astronaut",
         "type"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Astronaut ; dbp:type dbr:European_Space_Agency }",
      "question": "give me all esa astronauts.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "PROPN",
         "PRON",
         "NOUN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         2,
         3,
         1,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "compound",
         "dobj",
         "dobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         3,
         2,
         2,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "es",
            "pos": "NOUN",
            "dep-tok": "compound",
            "dep-lvl": 3
         },
         "4": {
            "token": "a",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "5": {
            "token": "astronauts",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "6": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "78",
      "en_ques": "give me all federal chancellors of germany.",
      "en_key": "germany, federal chancellors",
      "de_ques": "gib mir alle bundeskanzler.",
      "de_key": "bundeskanzler",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Person> { ?uri <http://dbpedia.org/ontology/office> 'Chancellor of Germany' } UNION { ?uri <http://dbpedia.org/property/office> <http://dbpedia.org/resource/Chancellor_of_Germany> } }",
      "entities": [
         "Chancellor_of_Germany"
      ],
      "relations": [
         "Person",
         "office",
         "office"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Person { ?uri dbo:office 'Chancellor of Germany' } UNION { ?uri dbp:office dbr:Chancellor_of_Germany } }",
      "question": "give me all federal chancellors of germany.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "AUX",
         "NOUN",
         "NOUN",
         "PRON",
         "PROPN",
         "X",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         1,
         13,
         1,
         1,
         3,
         2,
         5,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "amod",
         "dobj",
         "dobj",
         "dobj",
         "prep",
         "pobj",
         "pobj",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         3,
         2,
         2,
         2,
         3,
         4,
         4,
         4,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "federal",
            "pos": "ADJ",
            "dep-tok": "amod",
            "dep-lvl": 3
         },
         "4": {
            "token": "chance",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "5": {
            "token": "ll",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "6": {
            "token": "ors",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "7": {
            "token": "of",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 3
         },
         "8": {
            "token": "g",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "9": {
            "token": "erman",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "10": {
            "token": "y",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "11": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "79",
      "en_ques": "show me everyone who was born on halloween.",
      "en_key": "person, born on, halloween",
      "de_ques": "nenne mir alle personen, die an halloween geboren sind. ",
      "de_key": "personen, geboren, halloween",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Person> { ?uri <http://dbpedia.org/ontology/birthDate> ?date } UNION { ?uri <http://dbpedia.org/property/birthDate> ?date } <http://dbpedia.org/resource/Halloween> <http://dbpedia.org/property/date> ?date }",
      "entities": [
         "Halloween"
      ],
      "relations": [
         "Person",
         "birthDate",
         "birthDate",
         "date"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Person { ?uri dbo:birthDate ?date } UNION { ?uri dbp:birthDate ?date } dbr:Halloween dbp:date ?date }",
      "question": "show me everyone who was born on halloween.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "PROPN",
         "PROPN",
         "NOUN",
         "NOUN",
         "PROPN",
         "VERB",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         2,
         2,
         1,
         1,
         2,
         7,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "dobj",
         "nsubjpass",
         "auxpass",
         "relcl",
         "prep",
         "pobj",
         "pobj",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         2,
         4,
         4,
         3,
         4,
         5,
         5,
         5,
         2
      ],
      "mapping": {
         "0": {
            "token": "show",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "everyone",
            "pos": "PRON",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "3": {
            "token": "who",
            "pos": "PRON",
            "dep-tok": "nsubjpass",
            "dep-lvl": 4
         },
         "4": {
            "token": "was",
            "pos": "AUX",
            "dep-tok": "auxpass",
            "dep-lvl": 4
         },
         "5": {
            "token": "born",
            "pos": "VERB",
            "dep-tok": "relcl",
            "dep-lvl": 3
         },
         "6": {
            "token": "on",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 4
         },
         "7": {
            "token": "hall",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "8": {
            "token": "ow",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "9": {
            "token": "een",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "10": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "86",
      "en_ques": "give me all actors who were born in berlin.",
      "en_key": "actors, born, berlin",
      "de_ques": "gib mir alle in berlin geborenenen schauspieler.",
      "de_key": "schauspieler, geboren, berlin",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Actor> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Berlin> }",
      "entities": [
         "Berlin"
      ],
      "relations": [
         "Actor",
         "birthPlace"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Actor ; dbo:birthPlace dbr:Berlin }",
      "question": "give me all actors who were born in berlin.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "PROPN",
         "NOUN",
         "NOUN",
         "PROPN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         1,
         1,
         2,
         1,
         1,
         2,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "dobj",
         "nsubjpass",
         "auxpass",
         "relcl",
         "pobj",
         "pobj",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         2,
         4,
         4,
         3,
         5,
         5,
         5,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "actors",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "who",
            "pos": "PRON",
            "dep-tok": "nsubjpass",
            "dep-lvl": 4
         },
         "5": {
            "token": "were",
            "pos": "AUX",
            "dep-tok": "auxpass",
            "dep-lvl": 4
         },
         "6": {
            "token": "born",
            "pos": "VERB",
            "dep-tok": "relcl",
            "dep-lvl": 3
         },
         "7": {
            "token": "in",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "8": {
            "token": "ber",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "9": {
            "token": "lin",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "10": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "91",
      "en_ques": "give me all the tv shows with neil patrick harris.",
      "en_key": "tv shows, neil patrick harris",
      "de_ques": "gib mir alle fernsehserien mit neil patrick harris.",
      "de_key": "fernsehserien, neil patrick harris",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/TelevisionShow> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Neil_Patrick_Harris> }",
      "entities": [
         "Neil_Patrick_Harris"
      ],
      "relations": [
         "TelevisionShow",
         "starring"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:TelevisionShow ; dbo:starring dbr:Neil_Patrick_Harris }",
      "question": "give me all the tv shows with neil patrick harris.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "PROPN",
         "PROPN",
         "PROPN",
         "NOUN",
         "PROPN",
         "PROPN",
         "PROPN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         1,
         1,
         2,
         2,
         2,
         1,
         2,
         2,
         2,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "predet",
         "det",
         "nsubj",
         "ccomp",
         "prep",
         "compound",
         "compound",
         "compound",
         "compound",
         "pobj",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         3,
         4,
         2,
         4,
         6,
         6,
         6,
         6,
         5,
         5,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "predet",
            "dep-lvl": 3
         },
         "3": {
            "token": "the",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "4": {
            "token": "tv",
            "pos": "NOUN",
            "dep-tok": "nsubj",
            "dep-lvl": 4
         },
         "5": {
            "token": "shows",
            "pos": "VERB",
            "dep-tok": "ccomp",
            "dep-lvl": 2
         },
         "6": {
            "token": "with",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 4
         },
         "7": {
            "token": "ne",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 6
         },
         "8": {
            "token": "il",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 6
         },
         "9": {
            "token": "pat",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 6
         },
         "10": {
            "token": "rick",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 6
         },
         "11": {
            "token": "har",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "12": {
            "token": "ris",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "13": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "94",
      "en_ques": "give me all swedish holidays.",
      "en_key": "swedish holidays",
      "de_ques": "gib mir alle schwedischen feiertage.",
      "de_key": "schwedische feiertage",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Holiday> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden> }",
      "entities": [
         "Sweden"
      ],
      "relations": [
         "Holiday",
         "country"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Holiday ; dbo:country dbr:Sweden }",
      "question": "give me all swedish holidays.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "PROPN",
         "PROPN",
         "ADJ",
         "NOUN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         2,
         2,
         11,
         1,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "amod",
         "amod",
         "amod",
         "dobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         3,
         3,
         3,
         2,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "sw",
            "pos": "ADJ",
            "dep-tok": "amod",
            "dep-lvl": 3
         },
         "4": {
            "token": "ed",
            "pos": "ADJ",
            "dep-tok": "amod",
            "dep-lvl": 3
         },
         "5": {
            "token": "ish",
            "pos": "ADJ",
            "dep-tok": "amod",
            "dep-lvl": 3
         },
         "6": {
            "token": "holidays",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "7": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "96",
      "en_ques": "list all the musicals with music by leonard bernstein.",
      "en_key": "musicals, music by, leonard bernstein",
      "de_ques": "liste alle musicals mit musik von leonard bernstein auf.",
      "de_key": "musicals, musik von, leonard bernstein",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Musical> ; <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Leonard_Bernstein> }",
      "entities": [
         "Leonard_Bernstein"
      ],
      "relations": [
         "Musical",
         "musicBy"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Musical ; dbo:musicBy dbr:Leonard_Bernstein }",
      "question": "list all the musicals with music by leonard bernstein.",
      "question_pos_tokens": [
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "X",
         "PROPN",
         "NOUN",
         "NOUN",
         "NOUN",
         "ADP",
         "PROPN",
         "NOUN",
         "PROPN",
         "PROPN",
         "PUNCT"
      ],
      "question_pos_ids": [
         1,
         1,
         1,
         1,
         5,
         2,
         1,
         1,
         1,
         6,
         2,
         1,
         2,
         2,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "predet",
         "det",
         "dobj",
         "pobj",
         "prep",
         "pobj",
         "prep",
         "compound",
         "compound",
         "compound",
         "pobj",
         "pobj",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         3,
         3,
         2,
         4,
         3,
         4,
         3,
         6,
         6,
         6,
         5,
         5,
         5,
         2
      ],
      "mapping": {
         "0": {
            "token": "list",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "predet",
            "dep-lvl": 3
         },
         "2": {
            "token": "the",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "musical",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "s",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "5": {
            "token": "with",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 3
         },
         "6": {
            "token": "music",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "7": {
            "token": "by",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 3
         },
         "8": {
            "token": "le",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 6
         },
         "9": {
            "token": "on",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 6
         },
         "10": {
            "token": "ard",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 6
         },
         "11": {
            "token": "b",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "12": {
            "token": "ern",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "13": {
            "token": "stein",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "14": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "97",
      "en_ques": "give me all companies in the advertising industry.",
      "en_key": "company, advertising industry",
      "de_ques": "gib mir alle unternehmen, die in der werbebranche t\u00e4tig sind.",
      "de_key": "unternehmen, werbebranche",
      "sparql": "SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a <http://dbpedia.org/ontology/Company> { ?uri <http://dbpedia.org/ontology/industry> <http://dbpedia.org/resource/Advertising> } UNION { ?uri <http://dbpedia.org/ontology/industry> ?industry FILTER regex(?industry, 'advertising', 'i') } }",
      "entities": [
         "Advertising"
      ],
      "relations": [
         "Company",
         "industry",
         "industry"
      ],
      "fil_sparql": "SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a dbo:Company { ?uri dbo:industry dbr:Advertising } UNION { ?uri dbo:industry ?industry FILTER regex(?industry, 'advertising', 'i') } }",
      "question": "give me all companies in the advertising industry.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "VERB",
         "NOUN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         1,
         1,
         7,
         1,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "dobj",
         "prep",
         "det",
         "compound",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         2,
         3,
         5,
         5,
         4,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "companies",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "in",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 3
         },
         "5": {
            "token": "the",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 5
         },
         "6": {
            "token": "advertising",
            "pos": "NOUN",
            "dep-tok": "compound",
            "dep-lvl": 5
         },
         "7": {
            "token": "industry",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "8": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "101",
      "en_ques": "give me all australian metalcore bands.",
      "en_key": "australian, metalcore bands",
      "de_ques": "gib mir alle australischen metalcore-bands.",
      "de_key": "australisch, metalcore-bands",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Band> ; <http://dbpedia.org/ontology/genre> <http://dbpedia.org/resource/Metalcore> { ?uri <http://dbpedia.org/ontology/hometown> <http://dbpedia.org/resource/Australia> } UNION { ?uri <http://dbpedia.org/ontology/hometown> ?h . ?h <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Australia> } }",
      "entities": [
         "Metalcore",
         "Australia",
         "Australia"
      ],
      "relations": [
         "Band",
         "genre",
         "hometown",
         "hometown",
         "country"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Band ; dbo:genre dbr:Metalcore { ?uri dbo:hometown dbr:Australia } UNION { ?uri dbo:hometown ?h . ?h dbo:country dbr:Australia } }",
      "question": "give me all australian metalcore bands.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "PROPN",
         "PROPN",
         "PROPN",
         "NOUN",
         "NOUN",
         "NOUN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         2,
         2,
         2,
         1,
         1,
         1,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "amod",
         "amod",
         "amod",
         "compound",
         "compound",
         "dobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         3,
         3,
         3,
         3,
         3,
         2,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "aust",
            "pos": "ADJ",
            "dep-tok": "amod",
            "dep-lvl": 3
         },
         "4": {
            "token": "ral",
            "pos": "ADJ",
            "dep-tok": "amod",
            "dep-lvl": 3
         },
         "5": {
            "token": "ian",
            "pos": "ADJ",
            "dep-tok": "amod",
            "dep-lvl": 3
         },
         "6": {
            "token": "metal",
            "pos": "NOUN",
            "dep-tok": "compound",
            "dep-lvl": 3
         },
         "7": {
            "token": "core",
            "pos": "NOUN",
            "dep-tok": "compound",
            "dep-lvl": 3
         },
         "8": {
            "token": "bands",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "9": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "103",
      "en_ques": "give me all types of eating disorders.",
      "en_key": "types, eating disorders",
      "de_ques": "zeig mir alle arten von essst\u00f6rungen.",
      "de_key": "arten von, esst\u00f6rungen",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/class/yago/WikicatEatingDisorders> }",
      "entities": [],
      "relations": [
         "WikicatEatingDisorders"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a yago:WikicatEatingDisorders }",
      "question": "give me all types of eating disorders.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         1,
         1,
         1,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "dobj",
         "prep",
         "amod",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         2,
         3,
         5,
         4,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "types",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "of",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 3
         },
         "5": {
            "token": "eating",
            "pos": "VERB",
            "dep-tok": "amod",
            "dep-lvl": 5
         },
         "6": {
            "token": "disorders",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "7": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   }
]