[
   {
      "id": "109",
      "en_ques": "give me all books written by danielle steel.",
      "en_key": "book, written, danielle steel",
      "de_ques": "gib mir alle b\u00fccher, die danielle steel geschrieben hat.",
      "de_key": "buch, schreiben, danielle steel",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Book> ; <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Danielle_Steel> }",
      "entities": [
         "Danielle_Steel"
      ],
      "relations": [
         "Book",
         "author"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Book ; dbo:author dbr:Danielle_Steel }",
      "question": "give me all books written by danielle steel.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "ADJ",
         "PROPN",
         "NOUN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         1,
         1,
         1,
         11,
         2,
         1,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "dobj",
         "acl",
         "agent",
         "compound",
         "compound",
         "compound",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         2,
         3,
         4,
         6,
         6,
         6,
         5,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "books",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "written",
            "pos": "VERB",
            "dep-tok": "acl",
            "dep-lvl": 3
         },
         "5": {
            "token": "by",
            "pos": "ADP",
            "dep-tok": "agent",
            "dep-lvl": 4
         },
         "6": {
            "token": "d",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 6
         },
         "7": {
            "token": "aniel",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 6
         },
         "8": {
            "token": "le",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 6
         },
         "9": {
            "token": "steel",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "10": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "113",
      "en_ques": "give me all libraries established earlier than 1400.",
      "en_key": "libraries, established, earlier than 1400",
      "de_ques": "gib mir alle bibliotheken, die vor 1400 gegr\u00fcndet worden.",
      "de_key": "bibliotheken, gegr\u00fcndet, vor 1400",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Library> ; <http://dbpedia.org/property/established> ?year FILTER ( ?year < 1400 ) }",
      "entities": [],
      "relations": [
         "Library",
         "established"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Library ; dbp:established ?year FILTER ( ?year < 1400 ) }",
      "question": "give me all libraries established earlier than 1400.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "VERB",
         "NOUN",
         "PROPN",
         "NOUN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         7,
         1,
         2,
         1,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "dobj",
         "acl",
         "advmod",
         "prep",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         2,
         3,
         4,
         5,
         6,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "libraries",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "established",
            "pos": "VERB",
            "dep-tok": "acl",
            "dep-lvl": 3
         },
         "5": {
            "token": "earlier",
            "pos": "ADV",
            "dep-tok": "advmod",
            "dep-lvl": 4
         },
         "6": {
            "token": "than",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 5
         },
         "7": {
            "token": "1400",
            "pos": "NUM",
            "dep-tok": "pobj",
            "dep-lvl": 6
         },
         "8": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "118",
      "en_ques": "give me all methodist politicians.",
      "en_key": "politician, methodist",
      "de_ques": "gib mir alle politiker, die methodisten sind.",
      "de_key": "politiker, methodist",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Politician> ; <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Methodism> }",
      "entities": [
         "Methodism"
      ],
      "relations": [
         "Politician",
         "religion"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Politician ; dbo:religion dbr:Methodism }",
      "question": "give me all methodist politicians.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "X",
         "PROPN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         5,
         2,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "compound",
         "compound",
         "dobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         3,
         3,
         2,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "method",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 3
         },
         "4": {
            "token": "ist",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 3
         },
         "5": {
            "token": "politicians",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "6": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "128",
      "en_ques": "give me all actors called baldwin.",
      "en_key": "actors, called, baldwin",
      "de_ques": "gib mir alle schauspieler, die baldwin hei\u00dfen.",
      "de_key": "schauspieler, hei\u00dfen, baldwin",
      "sparql": "PREFIX foaf:<http://xmlns.com/foaf/0.1/> SELECT DISTINCT ?uri WHERE { ?uri foaf:surname 'Baldwin'@en . { ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Actor> . } UNION { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Actor> . } }",
      "entities": [
         "Actor"
      ],
      "relations": [
         "occupation",
         "Actor",
         "surname"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri foaf:surname 'Baldwin'@en . { ?uri dbo:occupation dbr:Actor . } UNION { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Actor . } }",
      "question": "give me all actors called baldwin.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "VERB",
         "NOUN",
         "VERB",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         7,
         1,
         7,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "dobj",
         "acl",
         "oprd",
         "oprd",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         2,
         3,
         4,
         4,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "actors",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "called",
            "pos": "VERB",
            "dep-tok": "acl",
            "dep-lvl": 3
         },
         "5": {
            "token": "bald",
            "pos": "PROPN",
            "dep-tok": "oprd",
            "dep-lvl": 4
         },
         "6": {
            "token": "win",
            "pos": "PROPN",
            "dep-tok": "oprd",
            "dep-lvl": 4
         },
         "7": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "141",
      "en_ques": "give me the birthdays of all actors of the television show charmed.",
      "en_key": "television show, charmed, actor, birthday",
      "de_ques": "gib mir die geburtstage von allen darstellern der fernsehserie charmed.",
      "de_key": "fernsehserie, charmed, darsteller, geburtstag",
      "sparql": "SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Charmed> <http://dbpedia.org/ontology/starring> ?actor . ?actor <http://dbpedia.org/ontology/birthDate> ?date }",
      "entities": [
         "Charmed"
      ],
      "relations": [
         "starring",
         "birthDate"
      ],
      "fil_sparql": "SELECT DISTINCT ?date WHERE { dbr:Charmed dbo:starring ?actor . ?actor dbo:birthDate ?date }",
      "question": "give me the birthdays of all actors of the television show charmed.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "PROPN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         1,
         1,
         1,
         1,
         1,
         1,
         1,
         1,
         1,
         2,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "dobj",
         "dobj",
         "prep",
         "det",
         "pobj",
         "prep",
         "det",
         "compound",
         "pobj",
         "acl",
         "acl",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         2,
         2,
         3,
         5,
         4,
         5,
         7,
         7,
         6,
         3,
         3,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "the",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "birth",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "days",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "5": {
            "token": "of",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 3
         },
         "6": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 5
         },
         "7": {
            "token": "actors",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "8": {
            "token": "of",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 5
         },
         "9": {
            "token": "the",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 7
         },
         "10": {
            "token": "television",
            "pos": "NOUN",
            "dep-tok": "compound",
            "dep-lvl": 7
         },
         "11": {
            "token": "show",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 6
         },
         "12": {
            "token": "char",
            "pos": "VERB",
            "dep-tok": "acl",
            "dep-lvl": 3
         },
         "13": {
            "token": "med",
            "pos": "VERB",
            "dep-tok": "acl",
            "dep-lvl": 3
         },
         "14": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "143",
      "en_ques": "give me a list of all lakes in denmark.",
      "en_key": "lake, denmark",
      "de_ques": "gib mir eine liste aller seen in d\u00e4nemark.",
      "de_key": "see, d\u00e4nemark",
      "sparql": "SELECT DISTINCT ?uri WHERE { { ?uri a <http://dbpedia.org/ontology/Lake> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark> } UNION { ?uri a <http://dbpedia.org/class/yago/LakesOfDenmark> } }",
      "entities": [
         "Denmark"
      ],
      "relations": [
         "Lake",
         "country",
         "LakesOfDenmark"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { { ?uri a dbo:Lake ; dbo:country dbr:Denmark } UNION { ?uri a yago:LakesOfDenmark } }",
      "question": "give me a list of all lakes in denmark.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "PROPN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "PROPN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         2,
         1,
         1,
         1,
         1,
         1,
         1,
         2,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "dobj",
         "prep",
         "det",
         "pobj",
         "prep",
         "pobj",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         2,
         3,
         5,
         4,
         5,
         6,
         6,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "a",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "list",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "of",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 3
         },
         "5": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 5
         },
         "6": {
            "token": "lakes",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "7": {
            "token": "in",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 5
         },
         "8": {
            "token": "den",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 6
         },
         "9": {
            "token": "mark",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 6
         },
         "10": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "145",
      "en_ques": "show me all english gothic buildings in kent.",
      "en_key": "english gothic buildings, kent",
      "de_ques": "zeige mir alle geb\u00e4ude in kent, die im stil der englischen gothik erbaut wurden.",
      "de_key": "geb\u00e4ude, kent, englische gotik",
      "sparql": "SELECT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Building> ; <http://dbpedia.org/ontology/architecturalStyle> <http://dbpedia.org/resource/English_Gothic_architecture> ; <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Kent> }",
      "entities": [
         "English_Gothic_architecture",
         "Kent"
      ],
      "relations": [
         "Building",
         "architecturalStyle",
         "location"
      ],
      "fil_sparql": "SELECT ?uri WHERE { ?uri a dbo:Building ; dbo:architecturalStyle dbr:English_Gothic_architecture ; dbo:location dbr:Kent }",
      "question": "show me all english gothic buildings in kent.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "PRON",
         "X",
         "PROPN",
         "NOUN",
         "NOUN",
         "NOUN",
         "PROPN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         3,
         5,
         2,
         1,
         1,
         1,
         2,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "amod",
         "dobj",
         "amod",
         "amod",
         "dobj",
         "prep",
         "pobj",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         3,
         2,
         3,
         3,
         2,
         3,
         4,
         4,
         2
      ],
      "mapping": {
         "0": {
            "token": "show",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "english",
            "pos": "ADJ",
            "dep-tok": "amod",
            "dep-lvl": 3
         },
         "4": {
            "token": "g",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "5": {
            "token": "oth",
            "pos": "ADJ",
            "dep-tok": "amod",
            "dep-lvl": 3
         },
         "6": {
            "token": "ic",
            "pos": "ADJ",
            "dep-tok": "amod",
            "dep-lvl": 3
         },
         "7": {
            "token": "buildings",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "8": {
            "token": "in",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 3
         },
         "9": {
            "token": "k",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "10": {
            "token": "ent",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "11": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "158",
      "en_ques": "list all episodes of the first season of the hbo television series the sopranos!",
      "en_key": "hbo, television series, sopranos, first season, episode",
      "de_ques": "liste alle episoden der ersten staffel der hbo-fernsehserie die sopranos auf.",
      "de_key": "hbo-fernsehserie, sopranos, erste staffel, episode",
      "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:The_Sopranos ; dbo:seasonNumber 1 }",
      "entities": [
         "The_Sopranos"
      ],
      "relations": [
         "series",
         "seasonNumber"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:The_Sopranos ; dbo:seasonNumber 1 }",
      "question": "list all episodes of the first season of the hbo television series the sopranos!",
      "question_pos_tokens": [
         "NOUN",
         "NOUN",
         "PROPN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "PROPN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "VERB",
         "INTJ",
         "PUNCT"
      ],
      "question_pos_ids": [
         1,
         1,
         2,
         1,
         1,
         1,
         1,
         1,
         1,
         1,
         2,
         1,
         1,
         1,
         1,
         1,
         7,
         9,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "det",
         "dobj",
         "prep",
         "det",
         "amod",
         "pobj",
         "prep",
         "det",
         "det",
         "compound",
         "compound",
         "pobj",
         "det",
         "appos",
         "appos",
         "appos",
         "appos",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         3,
         2,
         3,
         5,
         5,
         4,
         5,
         7,
         8,
         7,
         7,
         6,
         8,
         7,
         7,
         7,
         7,
         2
      ],
      "mapping": {
         "0": {
            "token": "list",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "2": {
            "token": "episodes",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "3": {
            "token": "of",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 3
         },
         "4": {
            "token": "the",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 5
         },
         "5": {
            "token": "first",
            "pos": "ADJ",
            "dep-tok": "amod",
            "dep-lvl": 5
         },
         "6": {
            "token": "season",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "7": {
            "token": "of",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 5
         },
         "8": {
            "token": "the",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 7
         },
         "9": {
            "token": "h",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 8
         },
         "10": {
            "token": "bo",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 7
         },
         "11": {
            "token": "television",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 7
         },
         "12": {
            "token": "series",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 6
         },
         "13": {
            "token": "the",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 8
         },
         "14": {
            "token": "s",
            "pos": "NOUN",
            "dep-tok": "appos",
            "dep-lvl": 7
         },
         "15": {
            "token": "op",
            "pos": "NOUN",
            "dep-tok": "appos",
            "dep-lvl": 7
         },
         "16": {
            "token": "ran",
            "pos": "NOUN",
            "dep-tok": "appos",
            "dep-lvl": 7
         },
         "17": {
            "token": "os",
            "pos": "NOUN",
            "dep-tok": "appos",
            "dep-lvl": 7
         },
         "18": {
            "token": "!",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "161",
      "en_ques": "give me all films produced by hal roach.",
      "en_key": "film, produce, hal roach",
      "de_ques": "gib mir alle filme des produzenten hal roach.",
      "de_key": "film, produzent, hal roach",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Hal_Roach> }",
      "entities": [
         "Hal_Roach"
      ],
      "relations": [
         "Film",
         "producer"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Film ; dbo:producer dbr:Hal_Roach }",
      "question": "give me all films produced by hal roach.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "PROPN",
         "NOUN",
         "NOUN",
         "NOUN",
         "PROPN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         2,
         1,
         1,
         1,
         2,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "dobj",
         "acl",
         "agent",
         "compound",
         "pobj",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         2,
         3,
         4,
         6,
         5,
         5,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "films",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "produced",
            "pos": "VERB",
            "dep-tok": "acl",
            "dep-lvl": 3
         },
         "5": {
            "token": "by",
            "pos": "ADP",
            "dep-tok": "agent",
            "dep-lvl": 4
         },
         "6": {
            "token": "hal",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 6
         },
         "7": {
            "token": "ro",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "8": {
            "token": "ach",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "9": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   }
]