[
   {
      "id": "46",
      "en_ques": "show a list of soccer clubs that play in the bundesliga.",
      "en_key": "soccer clubs, play, bundesliga",
      "de_ques": "zeig mir eine liste der fu\u00dfballvereine, die in der bundesliga spielen.",
      "de_key": "fu\u00dfballvereine, spielen, bundesliga",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Bundesliga> }",
      "entities": [
         "Bundesliga"
      ],
      "relations": [
         "SoccerClub",
         "league"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:SoccerClub ; dbo:league dbr:Bundesliga }",
      "question": "show a list of soccer clubs that play in the bundesliga.",
      "question_pos_tokens": [
         "VERB",
         "PROPN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "PROPN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "X",
         "PROPN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         2,
         1,
         1,
         1,
         1,
         2,
         1,
         1,
         1,
         1,
         5,
         2,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "det",
         "dobj",
         "prep",
         "compound",
         "pobj",
         "nsubj",
         "relcl",
         "prep",
         "det",
         "pobj",
         "pobj",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         3,
         2,
         3,
         5,
         4,
         6,
         5,
         6,
         8,
         7,
         7,
         7,
         2
      ],
      "mapping": {
         "0": {
            "token": "show",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "a",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "2": {
            "token": "list",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "3": {
            "token": "of",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 3
         },
         "4": {
            "token": "soccer",
            "pos": "NOUN",
            "dep-tok": "compound",
            "dep-lvl": 5
         },
         "5": {
            "token": "clubs",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "6": {
            "token": "that",
            "pos": "PRON",
            "dep-tok": "nsubj",
            "dep-lvl": 6
         },
         "7": {
            "token": "play",
            "pos": "VERB",
            "dep-tok": "relcl",
            "dep-lvl": 5
         },
         "8": {
            "token": "in",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 6
         },
         "9": {
            "token": "the",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 8
         },
         "10": {
            "token": "bund",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 7
         },
         "11": {
            "token": "es",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 7
         },
         "12": {
            "token": "liga",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 7
         },
         "13": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "51",
      "en_ques": "give me all danish movies.",
      "en_key": "movie, denmark",
      "de_ques": "gib mir alle d\u00e4nischen filme.",
      "de_key": "film, d\u00e4nemark",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark> }",
      "entities": [
         "Denmark"
      ],
      "relations": [
         "Film",
         "country"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Film ; dbo:country dbr:Denmark }",
      "question": "give me all danish movies.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "PROPN",
         "NOUN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         2,
         1,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "amod",
         "amod",
         "dobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         3,
         3,
         2,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "d",
            "pos": "ADJ",
            "dep-tok": "amod",
            "dep-lvl": 3
         },
         "4": {
            "token": "anish",
            "pos": "ADJ",
            "dep-tok": "amod",
            "dep-lvl": 3
         },
         "5": {
            "token": "movies",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "6": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "54",
      "en_ques": "give me all companies in munich.",
      "en_key": "company, munich",
      "de_ques": "gib mir alle unternehmen in m\u00fcnchen.",
      "de_key": "unternehmen, m\u00fcnchen",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Company> { ?uri <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Munich> } UNION { ?uri <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Munich> } UNION { ?uri <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Munich> } }",
      "entities": [
         "Munich",
         "Munich",
         "Munich"
      ],
      "relations": [
         "Company",
         "location",
         "headquarter",
         "locationCity"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Company { ?uri dbo:location dbr:Munich } UNION { ?uri dbo:headquarter dbr:Munich } UNION { ?uri dbo:locationCity dbr:Munich } }",
      "question": "give me all companies in munich.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "PROPN",
         "VERB",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         1,
         2,
         7,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "dobj",
         "prep",
         "pobj",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         2,
         2,
         4,
         4,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "companies",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "in",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 2
         },
         "5": {
            "token": "mun",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "6": {
            "token": "ich",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "7": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "55",
      "en_ques": "give me the capitals of all countries that the himalayas run through.",
      "en_key": "countries himalayas run through, capitals",
      "de_ques": "gib mir die haupst\u00e4dte aller l\u00e4nder, \u00fcber die sich der himalaya erstreckt.",
      "de_key": "l\u00e4nder, erstrecken, himalaya, haupstadt",
      "sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> ?country . ?country <http://dbpedia.org/ontology/capital> ?uri }",
      "entities": [
         "Himalayas"
      ],
      "relations": [
         "country",
         "capital"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { dbr:Himalayas dbo:country ?country . ?country dbo:capital ?uri }",
      "question": "give me the capitals of all countries that the himalayas run through.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "PROPN",
         "NOUN",
         "NOUN",
         "PROPN",
         "INTJ",
         "ADP",
         "NOUN",
         "NOUN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         1,
         1,
         1,
         2,
         1,
         1,
         2,
         9,
         6,
         1,
         1,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "dobj",
         "prep",
         "det",
         "pobj",
         "pobj",
         "det",
         "nsubj",
         "nsubj",
         "nsubj",
         "nsubj",
         "relcl",
         "advmod",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         2,
         3,
         5,
         4,
         7,
         6,
         7,
         7,
         7,
         7,
         5,
         7,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "the",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "capitals",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "of",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 3
         },
         "5": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 5
         },
         "6": {
            "token": "countries",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "7": {
            "token": "that",
            "pos": "PRON",
            "dep-tok": "pobj",
            "dep-lvl": 7
         },
         "8": {
            "token": "the",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 6
         },
         "9": {
            "token": "him",
            "pos": "PROPN",
            "dep-tok": "nsubj",
            "dep-lvl": 7
         },
         "10": {
            "token": "al",
            "pos": "PROPN",
            "dep-tok": "nsubj",
            "dep-lvl": 7
         },
         "11": {
            "token": "ay",
            "pos": "PROPN",
            "dep-tok": "nsubj",
            "dep-lvl": 7
         },
         "12": {
            "token": "as",
            "pos": "PROPN",
            "dep-tok": "nsubj",
            "dep-lvl": 7
         },
         "13": {
            "token": "run",
            "pos": "VERB",
            "dep-tok": "relcl",
            "dep-lvl": 5
         },
         "14": {
            "token": "through",
            "pos": "ADP",
            "dep-tok": "advmod",
            "dep-lvl": 7
         },
         "15": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "59",
      "en_ques": "give me all islands that belong to japan.",
      "en_key": "islands, japan",
      "de_ques": "gib mir alle inseln, die zu japan geh\u00f6ren.",
      "de_key": "inseln, japan",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Island> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Japan> }",
      "entities": [
         "Japan"
      ],
      "relations": [
         "Island",
         "country"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Island ; dbo:country dbr:Japan }",
      "question": "give me all islands that belong to japan.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "PROPN",
         "PROPN",
         "PROPN",
         "ADP",
         "PROPN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         2,
         2,
         2,
         6,
         2,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "dobj",
         "nsubj",
         "relcl",
         "prep",
         "pobj",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         2,
         4,
         3,
         4,
         5,
         5,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "islands",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "that",
            "pos": "PRON",
            "dep-tok": "nsubj",
            "dep-lvl": 4
         },
         "5": {
            "token": "belong",
            "pos": "VERB",
            "dep-tok": "relcl",
            "dep-lvl": 3
         },
         "6": {
            "token": "to",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 4
         },
         "7": {
            "token": "j",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "8": {
            "token": "apan",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "9": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "61",
      "en_ques": "give me all apollo 14 astronauts.",
      "en_key": "astronaut, apollo 14",
      "de_ques": "gib mir alle apollo-14-astronauten.",
      "de_key": "astronaut, apollo 14",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/mission> <http://dbpedia.org/resource/Apollo_14> }",
      "entities": [
         "Apollo_14"
      ],
      "relations": [
         "mission"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri dbo:mission dbr:Apollo_14 }",
      "question": "give me all apollo 14 astronauts.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "PROPN",
         "PROPN",
         "NOUN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         2,
         2,
         1,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "nmod",
         "nmod",
         "nummod",
         "dobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         4,
         4,
         4,
         3,
         2,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 4
         },
         "3": {
            "token": "ap",
            "pos": "PROPN",
            "dep-tok": "nmod",
            "dep-lvl": 4
         },
         "4": {
            "token": "ollo",
            "pos": "PROPN",
            "dep-tok": "nmod",
            "dep-lvl": 4
         },
         "5": {
            "token": "14",
            "pos": "NUM",
            "dep-tok": "nummod",
            "dep-lvl": 3
         },
         "6": {
            "token": "astronauts",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "7": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "64",
      "en_ques": "give me all soccer clubs in the premier league.",
      "en_key": "premier league, soccer club",
      "de_ques": "gib mir alle vereine in der premier league.",
      "de_key": "premier league, verein",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Premier_League> }",
      "entities": [
         "Premier_League"
      ],
      "relations": [
         "SoccerClub",
         "league"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:SoccerClub ; dbo:league dbr:Premier_League }",
      "question": "give me all soccer clubs in the premier league.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         1,
         1,
         1,
         1,
         1,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "compound",
         "dobj",
         "prep",
         "det",
         "amod",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         3,
         2,
         3,
         5,
         5,
         4,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "soccer",
            "pos": "NOUN",
            "dep-tok": "compound",
            "dep-lvl": 3
         },
         "4": {
            "token": "clubs",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "5": {
            "token": "in",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 3
         },
         "6": {
            "token": "the",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 5
         },
         "7": {
            "token": "premier",
            "pos": "ADJ",
            "dep-tok": "amod",
            "dep-lvl": 5
         },
         "8": {
            "token": "league",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "9": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "68",
      "en_ques": "give me all world heritage sites designated within the past two years.",
      "en_key": "world heritage site, designate, past two years",
      "de_ques": "gib mir alle welterbest\u00e4tten, die in den vergangenen zwei jahren aufgenommen wurden.",
      "de_key": "welterbest\u00e4tte, aufnehmen, vergangene zwei jahre",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/WorldHeritageSite> . { ?uri <http://dbpedia.org/property/year> '2013'^^xsd:integer . } UNION { ?uri <http://dbpedia.org/property/year> '2014'^^xsd:integer . } }",
      "entities": [],
      "relations": [
         "WorldHeritageSite",
         "year",
         "year"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:WorldHeritageSite . { ?uri dbp:year '2013'^^xsd:integer . } UNION { ?uri dbp:year '2014'^^xsd:integer . } }",
      "question": "give me all world heritage sites designated within the past two years.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "PROPN",
         "NOUN",
         "VERB",
         "PROPN",
         "NOUN",
         "PROPN",
         "NOUN",
         "NOUN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         2,
         1,
         7,
         2,
         1,
         2,
         1,
         1,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "compound",
         "compound",
         "dobj",
         "acl",
         "prep",
         "det",
         "amod",
         "nummod",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         4,
         3,
         4,
         2,
         4,
         5,
         7,
         7,
         7,
         6,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 4
         },
         "3": {
            "token": "world",
            "pos": "NOUN",
            "dep-tok": "compound",
            "dep-lvl": 3
         },
         "4": {
            "token": "heritage",
            "pos": "NOUN",
            "dep-tok": "compound",
            "dep-lvl": 4
         },
         "5": {
            "token": "sites",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "6": {
            "token": "designated",
            "pos": "VERB",
            "dep-tok": "acl",
            "dep-lvl": 4
         },
         "7": {
            "token": "within",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 5
         },
         "8": {
            "token": "the",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 7
         },
         "9": {
            "token": "past",
            "pos": "ADJ",
            "dep-tok": "amod",
            "dep-lvl": 7
         },
         "10": {
            "token": "two",
            "pos": "NUM",
            "dep-tok": "nummod",
            "dep-lvl": 7
         },
         "11": {
            "token": "years",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 6
         },
         "12": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "69",
      "en_ques": "give me all actors who were born in paris after 1950.",
      "en_key": "actors, born, paris, after 1950",
      "de_ques": "gib mir alle schauspieler, die nach 1950 in paris geboren wurden.",
      "de_key": "schauspieler, geboren, nach 1950, in paris",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Actor> . ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Paris> . ?uri <http://dbpedia.org/ontology/birthDate> ?date . FILTER ( ?date >= xsd:dateTime('1950-12-31T00:00:00Z')) }",
      "entities": [
         "Paris"
      ],
      "relations": [
         "Actor",
         "birthPlace",
         "birthDate"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Actor . ?uri dbo:birthPlace dbr:Paris . ?uri dbo:birthDate ?date . FILTER ( ?date = xsd:dateTime('1950-12-31T00:00:00Z')) }",
      "question": "give me all actors who were born in paris after 1950.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "PROPN",
         "NOUN",
         "PROPN",
         "AUX",
         "NOUN",
         "PRON",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         1,
         1,
         2,
         1,
         2,
         13,
         1,
         3,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "dobj",
         "nsubjpass",
         "auxpass",
         "relcl",
         "prep",
         "pobj",
         "pobj",
         "prep",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         2,
         4,
         4,
         3,
         4,
         5,
         5,
         4,
         6,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "actors",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "who",
            "pos": "PRON",
            "dep-tok": "nsubjpass",
            "dep-lvl": 4
         },
         "5": {
            "token": "were",
            "pos": "AUX",
            "dep-tok": "auxpass",
            "dep-lvl": 4
         },
         "6": {
            "token": "born",
            "pos": "VERB",
            "dep-tok": "relcl",
            "dep-lvl": 3
         },
         "7": {
            "token": "in",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 4
         },
         "8": {
            "token": "par",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "9": {
            "token": "is",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "10": {
            "token": "after",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 4
         },
         "11": {
            "token": "1950",
            "pos": "NUM",
            "dep-tok": "pobj",
            "dep-lvl": 6
         },
         "12": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "71",
      "en_ques": "give me all australian nonprofit organizations.",
      "en_key": "nonprofit organization, australia",
      "de_ques": "gib mir alle gemeinn\u00fctzigen organisationen in australien.",
      "de_key": "gemeinn\u00fctzige organisation, australien",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/Nonprofit_organization> { ?uri <http://dbpedia.org/ontology/locationCountry> <http://dbpedia.org/resource/Australia> } UNION { ?uri <http://dbpedia.org/ontology/location> ?x . ?x <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Australia> } }",
      "entities": [
         "Nonprofit_organization",
         "Australia",
         "Australia"
      ],
      "relations": [
         "type",
         "locationCountry",
         "location",
         "country"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri dbo:type dbr:Nonprofit_organization { ?uri dbo:locationCountry dbr:Australia } UNION { ?uri dbo:location ?x . ?x dbo:country dbr:Australia } }",
      "question": "give me all australian nonprofit organizations.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "PROPN",
         "PROPN",
         "PROPN",
         "NOUN",
         "NOUN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         2,
         2,
         2,
         1,
         1,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "amod",
         "amod",
         "amod",
         "amod",
         "dobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         3,
         3,
         3,
         3,
         2,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "aust",
            "pos": "ADJ",
            "dep-tok": "amod",
            "dep-lvl": 3
         },
         "4": {
            "token": "ral",
            "pos": "ADJ",
            "dep-tok": "amod",
            "dep-lvl": 3
         },
         "5": {
            "token": "ian",
            "pos": "ADJ",
            "dep-tok": "amod",
            "dep-lvl": 3
         },
         "6": {
            "token": "nonprofit",
            "pos": "ADJ",
            "dep-tok": "amod",
            "dep-lvl": 3
         },
         "7": {
            "token": "organizations",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "8": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   }
]