[
   {
      "id": "213",
      "en_ques": "give me all movies directed by francis ford coppola.",
      "en_key": "movie, direct, francis ford coppola",
      "de_ques": "gib mir alle filme, bei denen francis ford coppola regie gef\u00fchrt hat.",
      "de_key": "film, regie, francis ford coppola",
      "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:director res:Francis_Ford_Coppola }",
      "entities": [
         "Francis_Ford_Coppola"
      ],
      "relations": [
         "Film",
         "director"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:director res:Francis_Ford_Coppola }",
      "question": "give me all movies directed by francis ford coppola.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "VERB",
         "NOUN",
         "NOUN",
         "AUX",
         "ADP",
         "X",
         "NOUN",
         "PROPN",
         "PROPN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         7,
         1,
         1,
         13,
         6,
         5,
         1,
         2,
         2,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "dobj",
         "acl",
         "agent",
         "compound",
         "compound",
         "compound",
         "compound",
         "pobj",
         "pobj",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         2,
         3,
         4,
         6,
         6,
         6,
         6,
         5,
         5,
         5,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "movies",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "directed",
            "pos": "VERB",
            "dep-tok": "acl",
            "dep-lvl": 3
         },
         "5": {
            "token": "by",
            "pos": "ADP",
            "dep-tok": "agent",
            "dep-lvl": 4
         },
         "6": {
            "token": "franc",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 6
         },
         "7": {
            "token": "is",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 6
         },
         "8": {
            "token": "for",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 6
         },
         "9": {
            "token": "d",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 6
         },
         "10": {
            "token": "co",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "11": {
            "token": "pp",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "12": {
            "token": "ola",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "13": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "231",
      "en_ques": "give me all launch pads operated by nasa.",
      "en_key": "launch pad, operate, nasa",
      "de_ques": "gib mir alle von der nasa betriebenen startrampen.",
      "de_key": "startrampe, betreiben, nasa",
      "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:LaunchPad ; dbo:operator res:NASA }",
      "entities": [
         "NASA"
      ],
      "relations": [
         "LaunchPad",
         "operator"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:LaunchPad ; dbo:operator res:NASA }",
      "question": "give me all launch pads operated by nasa.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "VERB",
         "NOUN",
         "NOUN",
         "PROPN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         1,
         7,
         1,
         1,
         2,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "compound",
         "dobj",
         "acl",
         "agent",
         "pobj",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         3,
         2,
         3,
         4,
         5,
         5,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "launch",
            "pos": "NOUN",
            "dep-tok": "compound",
            "dep-lvl": 3
         },
         "4": {
            "token": "pads",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "5": {
            "token": "operated",
            "pos": "VERB",
            "dep-tok": "acl",
            "dep-lvl": 3
         },
         "6": {
            "token": "by",
            "pos": "ADP",
            "dep-tok": "agent",
            "dep-lvl": 4
         },
         "7": {
            "token": "n",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "8": {
            "token": "asa",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "9": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "249",
      "en_ques": "list all the musicals with music by elton john.",
      "en_key": "musicals, music by, elton john",
      "de_ques": "liste alle musicals mit musik von elton john auf.",
      "de_key": "musicals, musik von, elton john",
      "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Musical ; dbo:musicBy res:Elton_John }",
      "entities": [
         "Elton_John"
      ],
      "relations": [
         "Musical",
         "musicBy"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Musical ; dbo:musicBy res:Elton_John }",
      "question": "list all the musicals with music by elton john.",
      "question_pos_tokens": [
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "X",
         "PROPN",
         "NOUN",
         "NOUN",
         "PROPN",
         "NOUN",
         "NOUN",
         "PUNCT"
      ],
      "question_pos_ids": [
         1,
         1,
         1,
         1,
         5,
         2,
         1,
         1,
         2,
         1,
         1,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "predet",
         "det",
         "dobj",
         "pobj",
         "prep",
         "pobj",
         "prep",
         "compound",
         "compound",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         3,
         3,
         2,
         4,
         3,
         4,
         3,
         6,
         6,
         5,
         2
      ],
      "mapping": {
         "0": {
            "token": "list",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "predet",
            "dep-lvl": 3
         },
         "2": {
            "token": "the",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "musical",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "s",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "5": {
            "token": "with",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 3
         },
         "6": {
            "token": "music",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "7": {
            "token": "by",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 3
         },
         "8": {
            "token": "el",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 6
         },
         "9": {
            "token": "ton",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 6
         },
         "10": {
            "token": "john",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "11": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "260",
      "en_ques": "give me the runtime of toy story.",
      "en_key": "runtime, toy story",
      "de_ques": "gib mir die laufzeit von toy story.",
      "de_key": "laufzeit, toy story",
      "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?runtime WHERE { res:Toy_Story dbo:runtime ?runtime }",
      "entities": [
         "Toy_Story"
      ],
      "relations": [
         "runtime"
      ],
      "fil_sparql": "SELECT DISTINCT ?runtime WHERE { res:Toy_Story dbo:runtime ?runtime }",
      "question": "give me the runtime of toy story.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "ADJ",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         1,
         1,
         11,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "dobj",
         "prep",
         "compound",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         2,
         3,
         5,
         4,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "the",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "runtime",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "of",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 3
         },
         "5": {
            "token": "toy",
            "pos": "NOUN",
            "dep-tok": "compound",
            "dep-lvl": 5
         },
         "6": {
            "token": "story",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "7": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "275",
      "en_ques": "list the children of margaret thatcher.",
      "en_key": "margaret thatcher, child",
      "de_ques": "liste die kinder von margaret thatcher auf.",
      "de_key": "margaret thatcher, kind",
      "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Margaret_Thatcher dbo:child ?uri }",
      "entities": [
         "Margaret_Thatcher"
      ],
      "relations": [
         "child"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { res:Margaret_Thatcher dbo:child ?uri }",
      "question": "list the children of margaret thatcher.",
      "question_pos_tokens": [
         "NOUN",
         "NOUN",
         "PROPN",
         "NOUN",
         "NOUN",
         "X",
         "PROPN",
         "PROPN",
         "PUNCT"
      ],
      "question_pos_ids": [
         1,
         1,
         2,
         1,
         1,
         5,
         2,
         2,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "det",
         "dobj",
         "prep",
         "compound",
         "compound",
         "pobj",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         3,
         2,
         3,
         5,
         5,
         4,
         4,
         2
      ],
      "mapping": {
         "0": {
            "token": "list",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "the",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "2": {
            "token": "children",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "3": {
            "token": "of",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 3
         },
         "4": {
            "token": "marg",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 5
         },
         "5": {
            "token": "aret",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 5
         },
         "6": {
            "token": "that",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "7": {
            "token": "cher",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "8": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "286",
      "en_ques": "give me all actors starring in movies directed by william shatner.",
      "en_key": "actor, starring, movie, direct, william shatner",
      "de_ques": "gib mir alle schauspieler von filmen, in denen william shatner regie gef\u00fchrt hat.",
      "de_key": "schauspieler, film, regie, william shatner",
      "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner ; dbo:starring ?uri }",
      "entities": [
         "William_Shatner"
      ],
      "relations": [
         "director",
         "starring"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner ; dbo:starring ?uri }",
      "question": "give me all actors starring in movies directed by william shatner.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "VERB",
         "NOUN",
         "NOUN",
         "VERB",
         "NOUN",
         "NOUN",
         "PROPN",
         "PROPN",
         "ADP",
         "PROPN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         7,
         1,
         1,
         7,
         1,
         1,
         2,
         2,
         6,
         2,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "dobj",
         "acl",
         "prep",
         "pobj",
         "acl",
         "agent",
         "compound",
         "compound",
         "pobj",
         "pobj",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         2,
         3,
         4,
         5,
         6,
         7,
         9,
         9,
         8,
         8,
         8,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "actors",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "starring",
            "pos": "VERB",
            "dep-tok": "acl",
            "dep-lvl": 3
         },
         "5": {
            "token": "in",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 4
         },
         "6": {
            "token": "movies",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "7": {
            "token": "directed",
            "pos": "VERB",
            "dep-tok": "acl",
            "dep-lvl": 6
         },
         "8": {
            "token": "by",
            "pos": "ADP",
            "dep-tok": "agent",
            "dep-lvl": 7
         },
         "9": {
            "token": "will",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 9
         },
         "10": {
            "token": "iam",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 9
         },
         "11": {
            "token": "sh",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 8
         },
         "12": {
            "token": "at",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 8
         },
         "13": {
            "token": "ner",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 8
         },
         "14": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "290",
      "en_ques": "list all games by gmt.",
      "en_key": "game, gmt",
      "de_ques": "liste alle spiele von gmt auf.",
      "de_key": "spiel, gmt",
      "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }",
      "entities": [
         "GMT_Games"
      ],
      "relations": [
         "publisher"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }",
      "question": "list all games by gmt.",
      "question_pos_tokens": [
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "PRON",
         "PROPN",
         "PUNCT"
      ],
      "question_pos_ids": [
         1,
         1,
         1,
         1,
         3,
         2,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "det",
         "dobj",
         "prep",
         "pobj",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         3,
         2,
         3,
         4,
         4,
         2
      ],
      "mapping": {
         "0": {
            "token": "list",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "2": {
            "token": "games",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "3": {
            "token": "by",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 3
         },
         "4": {
            "token": "g",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "5": {
            "token": "mt",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "6": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "295",
      "en_ques": "give me all video games published by mean hamster software.",
      "en_key": "video game, publish, mean hamster software",
      "de_ques": "gib mir alle videospiele von mean hamster software.",
      "de_key": "videospiel, mean hamster software",
      "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:VideoGame ; dbo:publisher res:Mean_Hamster_Software }",
      "entities": [
         "Mean_Hamster_Software"
      ],
      "relations": [
         "VideoGame",
         "publisher"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:VideoGame ; dbo:publisher res:Mean_Hamster_Software }",
      "question": "give me all video games published by mean hamster software.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "PROPN",
         "NOUN",
         "VERB",
         "NOUN",
         "PROPN",
         "NOUN",
         "X",
         "VERB",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         2,
         1,
         7,
         1,
         2,
         1,
         5,
         7,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "compound",
         "dobj",
         "acl",
         "agent",
         "compound",
         "compound",
         "compound",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         3,
         2,
         3,
         4,
         6,
         6,
         6,
         5,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "video",
            "pos": "NOUN",
            "dep-tok": "compound",
            "dep-lvl": 3
         },
         "4": {
            "token": "games",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "5": {
            "token": "published",
            "pos": "VERB",
            "dep-tok": "acl",
            "dep-lvl": 3
         },
         "6": {
            "token": "by",
            "pos": "ADP",
            "dep-tok": "agent",
            "dep-lvl": 4
         },
         "7": {
            "token": "mean",
            "pos": "ADJ",
            "dep-tok": "compound",
            "dep-lvl": 6
         },
         "8": {
            "token": "ham",
            "pos": "NOUN",
            "dep-tok": "compound",
            "dep-lvl": 6
         },
         "9": {
            "token": "ster",
            "pos": "NOUN",
            "dep-tok": "compound",
            "dep-lvl": 6
         },
         "10": {
            "token": "software",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "11": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "296",
      "en_ques": "give me all members of prodigy.",
      "en_key": "member, prodigy",
      "de_ques": "gib mir alle bandmitglieder von prodigy.",
      "de_key": "bandmitglied, prodigy",
      "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:The_Prodigy dbo:bandMember ?uri }",
      "entities": [
         "The_Prodigy"
      ],
      "relations": [
         "bandMember"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { res:The_Prodigy dbo:bandMember ?uri }",
      "question": "give me all members of prodigy.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "PROPN",
         "VERB",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         1,
         2,
         7,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "dobj",
         "prep",
         "pobj",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         2,
         3,
         4,
         4,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "members",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "of",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 3
         },
         "5": {
            "token": "pro",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "6": {
            "token": "digy",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "7": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "305",
      "en_ques": "which holidays are celebrated around the world? test2",
      "en_key": "holidays, celebrated, world",
      "de_ques": "welche feiertage werden auf der welt gefeiert? test1",
      "de_key": "feiertage, welt, gefeiert",
      "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Holiday }",
      "entities": [],
      "relations": [
         "Holiday"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Holiday }",
      "question": "which holidays are celebrated around the world test2",
      "question_pos_tokens": [
         "PRON",
         "NOUN",
         "NOUN",
         "ADJ",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "X"
      ],
      "question_pos_ids": [
         3,
         1,
         1,
         11,
         1,
         1,
         1,
         1,
         5
      ],
      "question_dep_ids": [
         "det",
         "nsubjpass",
         "auxpass",
         "ROOT",
         "prep",
         "det",
         "compound",
         "pobj",
         "pobj"
      ],
      "question_dep_lvl": [
         2,
         3,
         3,
         1,
         3,
         5,
         5,
         4,
         4
      ],
      "mapping": {
         "0": {
            "token": "which",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 2
         },
         "1": {
            "token": "holidays",
            "pos": "NOUN",
            "dep-tok": "nsubjpass",
            "dep-lvl": 3
         },
         "2": {
            "token": "are",
            "pos": "AUX",
            "dep-tok": "auxpass",
            "dep-lvl": 3
         },
         "3": {
            "token": "celebrated",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "4": {
            "token": "around",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 3
         },
         "5": {
            "token": "the",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 5
         },
         "6": {
            "token": "world",
            "pos": "NOUN",
            "dep-tok": "compound",
            "dep-lvl": 5
         },
         "7": {
            "token": "test",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "8": {
            "token": "2",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         }
      }
   }
]