[
   {
      "id": "164",
      "en_ques": "give me a list of all bandleaders that play trumpet.",
      "en_key": "bandleader, play, trumpet",
      "de_ques": "gib mir eine liste aller bandleader, die trompete spielen.",
      "de_key": "bandleader, spielen, trompete",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Bandleader> ; <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Trumpet> }",
      "entities": [
         "Bandleader",
         "Trumpet"
      ],
      "relations": [
         "occupation",
         "instrument"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri dbo:occupation dbr:Bandleader ; dbo:instrument dbr:Trumpet }",
      "question": "give me a list of all bandleaders that play trumpet.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "PROPN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "PROPN",
         "NOUN",
         "NOUN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         2,
         1,
         1,
         1,
         1,
         1,
         2,
         1,
         1,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "dobj",
         "prep",
         "det",
         "pobj",
         "pobj",
         "nsubj",
         "relcl",
         "dobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         2,
         3,
         5,
         4,
         4,
         6,
         5,
         6,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "a",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "list",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "of",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 3
         },
         "5": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 5
         },
         "6": {
            "token": "band",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "7": {
            "token": "leaders",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "8": {
            "token": "that",
            "pos": "PRON",
            "dep-tok": "nsubj",
            "dep-lvl": 6
         },
         "9": {
            "token": "play",
            "pos": "VERB",
            "dep-tok": "relcl",
            "dep-lvl": 5
         },
         "10": {
            "token": "trumpet",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 6
         },
         "11": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "171",
      "en_ques": "give me all movies with tom cruise.",
      "en_key": "movie, tom cruise",
      "de_ques": "gib mir alle filme mit tom cruise.",
      "de_key": "film, tom cruise",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Tom_Cruise> }",
      "entities": [
         "Tom_Cruise"
      ],
      "relations": [
         "Film",
         "starring"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Film ; dbo:starring dbr:Tom_Cruise }",
      "question": "give me all movies with tom cruise.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "PROPN",
         "NOUN",
         "NOUN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         2,
         1,
         1,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "dobj",
         "prep",
         "compound",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         2,
         2,
         5,
         4,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "movies",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "with",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 2
         },
         "5": {
            "token": "tom",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 5
         },
         "6": {
            "token": "cruise",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "7": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "173",
      "en_ques": "give me all cities in new jersey with more than 100000 inhabitants.",
      "en_key": "new jersey, city, inhabitants, more than 100000",
      "de_ques": "gib mir alle st\u00e4dte in new jersey, die mehr als 100000 einwohner haben.",
      "de_key": "new jersey, stadt, einwohner, mehr als 100000",
      "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:City ; dbo:isPartOf res:New_Jersey ; dbo:populationTotal ?inhabitants FILTER ( ?inhabitants > 100000 ) }",
      "entities": [
         "New_Jersey"
      ],
      "relations": [
         "City",
         "isPartOf",
         "populationTotal"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:City ; dbo:isPartOf res:New_Jersey ; dbo:populationTotal ?inhabitants FILTER ( ?inhabitants > 100000 ) }",
      "question": "give me all cities in new jersey with more than 100000 inhabitants.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "PROPN",
         "VERB",
         "PROPN",
         "NUM",
         "NUM",
         "NOUN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         1,
         1,
         1,
         2,
         7,
         2,
         10,
         10,
         1,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "dobj",
         "prep",
         "compound",
         "pobj",
         "prep",
         "amod",
         "quantmod",
         "nummod",
         "nummod",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         2,
         3,
         5,
         4,
         2,
         7,
         7,
         8,
         8,
         6,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "cities",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "in",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 3
         },
         "5": {
            "token": "new",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 5
         },
         "6": {
            "token": "jersey",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "7": {
            "token": "with",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 2
         },
         "8": {
            "token": "more",
            "pos": "ADJ",
            "dep-tok": "amod",
            "dep-lvl": 7
         },
         "9": {
            "token": "than",
            "pos": "ADP",
            "dep-tok": "quantmod",
            "dep-lvl": 7
         },
         "10": {
            "token": "100",
            "pos": "NUM",
            "dep-tok": "nummod",
            "dep-lvl": 8
         },
         "11": {
            "token": "000",
            "pos": "NUM",
            "dep-tok": "nummod",
            "dep-lvl": 8
         },
         "12": {
            "token": "inhabitants",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 6
         },
         "13": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "175",
      "en_ques": "give me all b-sides of the ramones.",
      "en_key": "ramones, b-sides",
      "de_ques": "gib mir alle b-seiten der ramones.",
      "de_key": "ramones, b-seiten",
      "sparql": "SELECT DISTINCT ?string WHERE { ?x <http://dbpedia.org/ontology/musicalArtist> <http://dbpedia.org/resource/Ramones> ; <http://dbpedia.org/ontology/bSide> ?string }",
      "entities": [
         "Ramones"
      ],
      "relations": [
         "musicalArtist",
         "bSide"
      ],
      "fil_sparql": "SELECT DISTINCT ?string WHERE { ?x dbo:musicalArtist dbr:Ramones ; dbo:bSide ?string }",
      "question": "give me all b-sides of the ramones.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "PUNCT",
         "X",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         4,
         5,
         1,
         1,
         1,
         1,
         1,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "meta",
         "punct",
         "dobj",
         "dobj",
         "prep",
         "det",
         "pobj",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         4,
         4,
         2,
         2,
         4,
         6,
         5,
         5,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "b",
            "pos": "NOUN",
            "dep-tok": "meta",
            "dep-lvl": 4
         },
         "4": {
            "token": "-",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 4
         },
         "5": {
            "token": "s",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "6": {
            "token": "ides",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "7": {
            "token": "of",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 4
         },
         "8": {
            "token": "the",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 6
         },
         "9": {
            "token": "ram",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "10": {
            "token": "ones",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "11": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "178",
      "en_ques": "list the seven kings of rome.",
      "en_key": "kings, rome",
      "de_ques": "gib mir eine liste aller k\u00f6nige von rom.",
      "de_key": "k\u00f6nige, rom",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/title> <http://dbpedia.org/resource/King_of_Rome> }",
      "entities": [
         "King_of_Rome"
      ],
      "relations": [
         "title"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri dbp:title dbr:King_of_Rome }",
      "question": "list the seven kings of rome.",
      "question_pos_tokens": [
         "NOUN",
         "NOUN",
         "PROPN",
         "NOUN",
         "NOUN",
         "NOUN",
         "INTJ",
         "PUNCT"
      ],
      "question_pos_ids": [
         1,
         1,
         2,
         1,
         1,
         1,
         9,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "det",
         "nummod",
         "dobj",
         "prep",
         "pobj",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         3,
         3,
         2,
         3,
         4,
         4,
         2
      ],
      "mapping": {
         "0": {
            "token": "list",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "the",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "2": {
            "token": "seven",
            "pos": "NUM",
            "dep-tok": "nummod",
            "dep-lvl": 3
         },
         "3": {
            "token": "kings",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "of",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 3
         },
         "5": {
            "token": "r",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "6": {
            "token": "ome",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "7": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "179",
      "en_ques": "give me all people that were born in vienna and died in berlin.",
      "en_key": "people, born, vienna, die, berlin",
      "de_ques": "gib mir alle personen, die in wien geboren wurden und in berlin gestorben sind.",
      "de_key": "person, geboren, wien, gestorben, berlin",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Vienna> ; <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Berlin> }",
      "entities": [
         "Vienna",
         "Berlin"
      ],
      "relations": [
         "birthPlace",
         "deathPlace"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri dbo:birthPlace dbr:Vienna ; dbo:deathPlace dbr:Berlin }",
      "question": "give me all people that were born in vienna and died in berlin.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "PROPN",
         "NOUN",
         "PROPN",
         "NOUN",
         "NOUN",
         "PROPN",
         "NOUN",
         "VERB",
         "NOUN",
         "NOUN",
         "PROPN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         2,
         1,
         2,
         1,
         1,
         2,
         1,
         7,
         1,
         1,
         2,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "dobj",
         "nsubjpass",
         "auxpass",
         "relcl",
         "prep",
         "pobj",
         "pobj",
         "cc",
         "conj",
         "pobj",
         "pobj",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         2,
         4,
         4,
         3,
         4,
         5,
         5,
         4,
         4,
         7,
         7,
         7,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "people",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "that",
            "pos": "PRON",
            "dep-tok": "nsubjpass",
            "dep-lvl": 4
         },
         "5": {
            "token": "were",
            "pos": "AUX",
            "dep-tok": "auxpass",
            "dep-lvl": 4
         },
         "6": {
            "token": "born",
            "pos": "VERB",
            "dep-tok": "relcl",
            "dep-lvl": 3
         },
         "7": {
            "token": "in",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 4
         },
         "8": {
            "token": "vi",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "9": {
            "token": "enna",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 5
         },
         "10": {
            "token": "and",
            "pos": "CCONJ",
            "dep-tok": "cc",
            "dep-lvl": 4
         },
         "11": {
            "token": "died",
            "pos": "VERB",
            "dep-tok": "conj",
            "dep-lvl": 4
         },
         "12": {
            "token": "in",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 7
         },
         "13": {
            "token": "ber",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 7
         },
         "14": {
            "token": "lin",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 7
         },
         "15": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "181",
      "en_ques": "show me all the breweries in australia.",
      "en_key": "breweries, australia",
      "de_ques": "zeig mir alle brauereien in australien.",
      "de_key": "brauereien, australien",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Brewery> { ?uri <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Australia> } UNION { ?uri <http://dbpedia.org/ontology/location> ?x . ?x <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Australia> } }",
      "entities": [
         "Australia",
         "Australia"
      ],
      "relations": [
         "Brewery",
         "location",
         "location",
         "country"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Brewery { ?uri dbo:location dbr:Australia } UNION { ?uri dbo:location ?x . ?x dbo:country dbr:Australia } }",
      "question": "show me all the breweries in australia.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "PROPN",
         "PROPN",
         "PROPN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         1,
         1,
         2,
         2,
         2,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "predet",
         "det",
         "dobj",
         "prep",
         "pobj",
         "pobj",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         3,
         2,
         3,
         4,
         4,
         4,
         2
      ],
      "mapping": {
         "0": {
            "token": "show",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "predet",
            "dep-lvl": 3
         },
         "3": {
            "token": "the",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "4": {
            "token": "breweries",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "5": {
            "token": "in",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 3
         },
         "6": {
            "token": "aust",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "7": {
            "token": "ral",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "8": {
            "token": "ia",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "9": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "183",
      "en_ques": "give me all soccer clubs in spain.",
      "en_key": "spain, soccer club",
      "de_ques": "gib mir alle fu\u00dfballvereine in spanien.",
      "de_key": "fu\u00dfballverein, spanien",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> { ?uri <http://dbpedia.org/ontology/ground> <http://dbpedia.org/resource/Spain> } UNION { ?uri <http://dbpedia.org/property/ground> ?ground FILTER regex(?ground, 'Spain') } }",
      "entities": [
         "Spain"
      ],
      "relations": [
         "SoccerClub",
         "ground",
         "ground"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:SoccerClub { ?uri dbo:ground dbr:Spain } UNION { ?uri dbp:ground ?ground FILTER regex(?ground, 'Spain') } }",
      "question": "give me all soccer clubs in spain.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "PROPN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         1,
         1,
         1,
         2,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "compound",
         "dobj",
         "pobj",
         "pobj",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         3,
         2,
         4,
         4,
         4,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "soccer",
            "pos": "NOUN",
            "dep-tok": "compound",
            "dep-lvl": 3
         },
         "4": {
            "token": "clubs",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "5": {
            "token": "in",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "6": {
            "token": "sp",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "7": {
            "token": "ain",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "8": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "185",
      "en_ques": "give me all breeds of the german shepherd dog.",
      "en_key": "breed, german shepherd dog",
      "de_ques": "gib mir alle sch\u00e4ferhundrassen.",
      "de_key": "sch\u00e4ferhundrasse",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd> }",
      "entities": [
         "German_Shepherd"
      ],
      "relations": [
         "breed"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri dbp:breed dbr:German_Shepherd }",
      "question": "give me all breeds of the german shepherd dog.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "PRON",
         "PROPN",
         "PROPN",
         "NOUN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         1,
         1,
         3,
         2,
         2,
         1,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "dobj",
         "prep",
         "det",
         "pobj",
         "amod",
         "compound",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         2,
         3,
         5,
         4,
         5,
         5,
         4,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "breeds",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "of",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 3
         },
         "5": {
            "token": "the",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 5
         },
         "6": {
            "token": "g",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "7": {
            "token": "erman",
            "pos": "ADJ",
            "dep-tok": "amod",
            "dep-lvl": 5
         },
         "8": {
            "token": "shepherd",
            "pos": "NOUN",
            "dep-tok": "compound",
            "dep-lvl": 5
         },
         "9": {
            "token": "dog",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "10": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "193",
      "en_ques": "is cola a beverage?",
      "en_key": "cola, beverage",
      "de_ques": "ist cola ein getr\u00e4nk?",
      "de_key": "cola, getr\u00e4nk",
      "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { res:Cola rdf:type dbo:Beverage }",
      "entities": [
         "Cola"
      ],
      "relations": [
         "Beverage"
      ],
      "fil_sparql": "ASK WHERE { res:Cola rdf:type dbo:Beverage }",
      "question": "is cola a beverage",
      "question_pos_tokens": [
         "AUX",
         "NOUN",
         "PRON",
         "PROPN",
         "NOUN"
      ],
      "question_pos_ids": [
         13,
         1,
         3,
         2,
         1
      ],
      "question_dep_ids": [
         "ROOT",
         "nsubj",
         "attr",
         "attr",
         "attr"
      ],
      "question_dep_lvl": [
         1,
         2,
         2,
         2,
         2
      ],
      "mapping": {
         "0": {
            "token": "is",
            "pos": "AUX",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "col",
            "pos": "NOUN",
            "dep-tok": "nsubj",
            "dep-lvl": 2
         },
         "2": {
            "token": "a",
            "pos": "NOUN",
            "dep-tok": "attr",
            "dep-lvl": 2
         },
         "3": {
            "token": "a",
            "pos": "NOUN",
            "dep-tok": "attr",
            "dep-lvl": 2
         },
         "4": {
            "token": "beverage",
            "pos": "NOUN",
            "dep-tok": "attr",
            "dep-lvl": 2
         }
      }
   }
]