[
   {
      "id": "313",
      "en_ques": "give me the birth place of frank sinatra.",
      "en_key": "birth place, frank sinatra",
      "de_ques": "gib mir den geburtsort von frank sinatra.",
      "de_key": "geburtsort, frank sinatra",
      "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?place WHERE { res:Frank_Sinatra dbo:birthPlace ?place }",
      "entities": [
         "Frank_Sinatra"
      ],
      "relations": [
         "birthPlace"
      ],
      "fil_sparql": "SELECT DISTINCT ?place WHERE { res:Frank_Sinatra dbo:birthPlace ?place }",
      "question": "give me the birth place of frank sinatra.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "PROPN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         1,
         1,
         1,
         1,
         2,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "compound",
         "dobj",
         "prep",
         "compound",
         "pobj",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         3,
         2,
         3,
         5,
         4,
         4,
         2
      ],
      "mapping": {
         "0": {
            "token": "give",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "the",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "birth",
            "pos": "NOUN",
            "dep-tok": "compound",
            "dep-lvl": 3
         },
         "4": {
            "token": "place",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "5": {
            "token": "of",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 3
         },
         "6": {
            "token": "frank",
            "pos": "PROPN",
            "dep-tok": "compound",
            "dep-lvl": 5
         },
         "7": {
            "token": "sin",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "8": {
            "token": "atra",
            "pos": "PROPN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "9": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   },
   {
      "id": "347",
      "en_ques": "show me all books in asimov's foundation series.",
      "en_key": "books, asimov, foundation series",
      "de_ques": "zeig mir alle b\u00fccher in asimovs foundation-serie.",
      "de_key": "asimov, foundation-serie, b\u00fccher",
      "sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:Foundation_series }",
      "entities": [
         "Foundation_series"
      ],
      "relations": [
         "series"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:Foundation_series }",
      "question": "show me all books in asimov's foundation series.",
      "question_pos_tokens": [
         "VERB",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "NOUN",
         "VERB",
         "AUX",
         "NOUN",
         "NOUN",
         "PUNCT"
      ],
      "question_pos_ids": [
         7,
         1,
         1,
         1,
         1,
         1,
         7,
         13,
         1,
         1,
         4
      ],
      "question_dep_ids": [
         "ROOT",
         "dative",
         "det",
         "dobj",
         "prep",
         "poss",
         "poss",
         "case",
         "compound",
         "pobj",
         "punct"
      ],
      "question_dep_lvl": [
         1,
         2,
         3,
         2,
         3,
         6,
         6,
         5,
         6,
         4,
         2
      ],
      "mapping": {
         "0": {
            "token": "show",
            "pos": "VERB",
            "dep-tok": "ROOT",
            "dep-lvl": 1
         },
         "1": {
            "token": "me",
            "pos": "PRON",
            "dep-tok": "dative",
            "dep-lvl": 2
         },
         "2": {
            "token": "all",
            "pos": "DET",
            "dep-tok": "det",
            "dep-lvl": 3
         },
         "3": {
            "token": "books",
            "pos": "NOUN",
            "dep-tok": "dobj",
            "dep-lvl": 2
         },
         "4": {
            "token": "in",
            "pos": "ADP",
            "dep-tok": "prep",
            "dep-lvl": 3
         },
         "5": {
            "token": "as",
            "pos": "PROPN",
            "dep-tok": "poss",
            "dep-lvl": 6
         },
         "6": {
            "token": "imov",
            "pos": "PROPN",
            "dep-tok": "poss",
            "dep-lvl": 6
         },
         "7": {
            "token": "'s",
            "pos": "PART",
            "dep-tok": "case",
            "dep-lvl": 5
         },
         "8": {
            "token": "foundation",
            "pos": "NOUN",
            "dep-tok": "compound",
            "dep-lvl": 6
         },
         "9": {
            "token": "series",
            "pos": "NOUN",
            "dep-tok": "pobj",
            "dep-lvl": 4
         },
         "10": {
            "token": ".",
            "pos": "PUNCT",
            "dep-tok": "punct",
            "dep-lvl": 2
         }
      }
   }
]