[
   {
      "id": "29",
      "en_ques": "show me all museums in london.",
      "en_key": "museums, london",
      "de_ques": "zeig mir alle museen in london.",
      "de_key": "london, museen",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Museum> ; <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/London> }",
      "entities": [
         "London"
      ],
      "relations": [
         "Museum",
         "location"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Museum ; dbo:location dbr:London }"
   },
   {
      "id": "40",
      "en_ques": "give all swimmers that were born in moscow.",
      "en_key": "swimmer, born, moscow",
      "de_ques": "zeig mir alle schwimmer, die in moskau geboren wurden.",
      "de_key": "schwimmer, geboren in, moskau",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Swimmer> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Moscow> }",
      "entities": [
         "Moscow"
      ],
      "relations": [
         "Swimmer",
         "birthPlace"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Swimmer ; dbo:birthPlace dbr:Moscow }"
   },
   {
      "id": "41",
      "en_ques": "give me all cosmonauts.",
      "en_key": "cosmonauts",
      "de_ques": "gib mir alle kosmonauten.",
      "de_key": "kosmonauten",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Astronaut> { ?uri <http://dbpedia.org/ontology/nationality> <http://dbpedia.org/resource/Russia> } UNION { ?uri <http://dbpedia.org/ontology/nationality> <http://dbpedia.org/resource/Soviet_Union> } }",
      "entities": [
         "Russia",
         "Soviet_Union"
      ],
      "relations": [
         "Astronaut",
         "nationality",
         "nationality"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Astronaut { ?uri dbo:nationality dbr:Russia } UNION { ?uri dbo:nationality dbr:Soviet_Union } }"
   },
   {
      "id": "46",
      "en_ques": "show a list of soccer clubs that play in the bundesliga.",
      "en_key": "soccer clubs, play, bundesliga",
      "de_ques": "zeig mir eine liste der fu\u00dfballvereine, die in der bundesliga spielen.",
      "de_key": "fu\u00dfballvereine, spielen, bundesliga",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Bundesliga> }",
      "entities": [
         "Bundesliga"
      ],
      "relations": [
         "SoccerClub",
         "league"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:SoccerClub ; dbo:league dbr:Bundesliga }"
   },
   {
      "id": "51",
      "en_ques": "give me all danish movies.",
      "en_key": "movie, denmark",
      "de_ques": "gib mir alle d\u00e4nischen filme.",
      "de_key": "film, d\u00e4nemark",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark> }",
      "entities": [
         "Denmark"
      ],
      "relations": [
         "Film",
         "country"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Film ; dbo:country dbr:Denmark }"
   },
   {
      "id": "54",
      "en_ques": "give me all companies in munich.",
      "en_key": "company, munich",
      "de_ques": "gib mir alle unternehmen in m\u00fcnchen.",
      "de_key": "unternehmen, m\u00fcnchen",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Company> { ?uri <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Munich> } UNION { ?uri <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Munich> } UNION { ?uri <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Munich> } }",
      "entities": [
         "Munich",
         "Munich",
         "Munich"
      ],
      "relations": [
         "Company",
         "location",
         "headquarter",
         "locationCity"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Company { ?uri dbo:location dbr:Munich } UNION { ?uri dbo:headquarter dbr:Munich } UNION { ?uri dbo:locationCity dbr:Munich } }"
   },
   {
      "id": "55",
      "en_ques": "give me the capitals of all countries that the himalayas run through.",
      "en_key": "countries himalayas run through, capitals",
      "de_ques": "gib mir die haupst\u00e4dte aller l\u00e4nder, \u00fcber die sich der himalaya erstreckt.",
      "de_key": "l\u00e4nder, erstrecken, himalaya, haupstadt",
      "sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> ?country . ?country <http://dbpedia.org/ontology/capital> ?uri }",
      "entities": [
         "Himalayas"
      ],
      "relations": [
         "country",
         "capital"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { dbr:Himalayas dbo:country ?country . ?country dbo:capital ?uri }"
   },
   {
      "id": "59",
      "en_ques": "give me all islands that belong to japan.",
      "en_key": "islands, japan",
      "de_ques": "gib mir alle inseln, die zu japan geh\u00f6ren.",
      "de_key": "inseln, japan",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Island> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Japan> }",
      "entities": [
         "Japan"
      ],
      "relations": [
         "Island",
         "country"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Island ; dbo:country dbr:Japan }"
   },
   {
      "id": "64",
      "en_ques": "give me all soccer clubs in the premier league.",
      "en_key": "premier league, soccer club",
      "de_ques": "gib mir alle vereine in der premier league.",
      "de_key": "premier league, verein",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Premier_League> }",
      "entities": [
         "Premier_League"
      ],
      "relations": [
         "SoccerClub",
         "league"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:SoccerClub ; dbo:league dbr:Premier_League }"
   },
   {
      "id": "68",
      "en_ques": "give me all world heritage sites designated within the past two years.",
      "en_key": "world heritage site, designate, past two years",
      "de_ques": "gib mir alle welterbest\u00e4tten, die in den vergangenen zwei jahren aufgenommen wurden.",
      "de_key": "welterbest\u00e4tte, aufnehmen, vergangene zwei jahre",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/WorldHeritageSite> . { ?uri <http://dbpedia.org/property/year> '2013'^^xsd:integer . } UNION { ?uri <http://dbpedia.org/property/year> '2014'^^xsd:integer . } }",
      "entities": [],
      "relations": [
         "WorldHeritageSite",
         "year",
         "year"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:WorldHeritageSite . { ?uri dbp:year '2013'^^xsd:integer . } UNION { ?uri dbp:year '2014'^^xsd:integer . } }"
   },
   {
      "id": "69",
      "en_ques": "give me all actors who were born in paris after 1950.",
      "en_key": "actors, born, paris, after 1950",
      "de_ques": "gib mir alle schauspieler, die nach 1950 in paris geboren wurden.",
      "de_key": "schauspieler, geboren, nach 1950, in paris",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Actor> . ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Paris> . ?uri <http://dbpedia.org/ontology/birthDate> ?date . FILTER ( ?date >= xsd:dateTime('1950-12-31T00:00:00Z')) }",
      "entities": [
         "Paris"
      ],
      "relations": [
         "Actor",
         "birthPlace",
         "birthDate"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Actor . ?uri dbo:birthPlace dbr:Paris . ?uri dbo:birthDate ?date . FILTER ( ?date = xsd:dateTime('1950-12-31T00:00:00Z')) }"
   },
   {
      "id": "71",
      "en_ques": "give me all australian nonprofit organizations.",
      "en_key": "nonprofit organization, australia",
      "de_ques": "gib mir alle gemeinn\u00fctzigen organisationen in australien.",
      "de_key": "gemeinn\u00fctzige organisation, australien",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/Nonprofit_organization> { ?uri <http://dbpedia.org/ontology/locationCountry> <http://dbpedia.org/resource/Australia> } UNION { ?uri <http://dbpedia.org/ontology/location> ?x . ?x <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Australia> } }",
      "entities": [
         "Nonprofit_organization",
         "Australia",
         "Australia"
      ],
      "relations": [
         "type",
         "locationCountry",
         "location",
         "country"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri dbo:type dbr:Nonprofit_organization { ?uri dbo:locationCountry dbr:Australia } UNION { ?uri dbo:location ?x . ?x dbo:country dbr:Australia } }"
   },
   {
      "id": "73",
      "en_ques": "give me all esa astronauts.",
      "en_key": "esa astronauts",
      "de_ques": "gib mir alle esa-astronauten.",
      "de_key": "esa-astronauten",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Astronaut> ; <http://dbpedia.org/property/type> <http://dbpedia.org/resource/European_Space_Agency> }",
      "entities": [
         "European_Space_Agency"
      ],
      "relations": [
         "Astronaut",
         "type"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Astronaut ; dbp:type dbr:European_Space_Agency }"
   },
   {
      "id": "78",
      "en_ques": "give me all federal chancellors of germany.",
      "en_key": "germany, federal chancellors",
      "de_ques": "gib mir alle bundeskanzler.",
      "de_key": "bundeskanzler",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Person> { ?uri <http://dbpedia.org/ontology/office> 'Chancellor of Germany' } UNION { ?uri <http://dbpedia.org/property/office> <http://dbpedia.org/resource/Chancellor_of_Germany> } }",
      "entities": [
         "Chancellor_of_Germany"
      ],
      "relations": [
         "Person",
         "office",
         "office"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Person { ?uri dbo:office 'Chancellor of Germany' } UNION { ?uri dbp:office dbr:Chancellor_of_Germany } }"
   },
   {
      "id": "79",
      "en_ques": "show me everyone who was born on halloween.",
      "en_key": "person, born on, halloween",
      "de_ques": "nenne mir alle personen, die an halloween geboren sind. ",
      "de_key": "personen, geboren, halloween",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Person> { ?uri <http://dbpedia.org/ontology/birthDate> ?date } UNION { ?uri <http://dbpedia.org/property/birthDate> ?date } <http://dbpedia.org/resource/Halloween> <http://dbpedia.org/property/date> ?date }",
      "entities": [
         "Halloween"
      ],
      "relations": [
         "Person",
         "birthDate",
         "birthDate",
         "date"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Person { ?uri dbo:birthDate ?date } UNION { ?uri dbp:birthDate ?date } dbr:Halloween dbp:date ?date }"
   },
   {
      "id": "86",
      "en_ques": "give me all actors who were born in berlin.",
      "en_key": "actors, born, berlin",
      "de_ques": "gib mir alle in berlin geborenenen schauspieler.",
      "de_key": "schauspieler, geboren, berlin",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Actor> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Berlin> }",
      "entities": [
         "Berlin"
      ],
      "relations": [
         "Actor",
         "birthPlace"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Actor ; dbo:birthPlace dbr:Berlin }"
   },
   {
      "id": "91",
      "en_ques": "give me all the tv shows with neil patrick harris.",
      "en_key": "tv shows, neil patrick harris",
      "de_ques": "gib mir alle fernsehserien mit neil patrick harris.",
      "de_key": "fernsehserien, neil patrick harris",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/TelevisionShow> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Neil_Patrick_Harris> }",
      "entities": [
         "Neil_Patrick_Harris"
      ],
      "relations": [
         "TelevisionShow",
         "starring"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:TelevisionShow ; dbo:starring dbr:Neil_Patrick_Harris }"
   },
   {
      "id": "94",
      "en_ques": "give me all swedish holidays.",
      "en_key": "swedish holidays",
      "de_ques": "gib mir alle schwedischen feiertage.",
      "de_key": "schwedische feiertage",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Holiday> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden> }",
      "entities": [
         "Sweden"
      ],
      "relations": [
         "Holiday",
         "country"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Holiday ; dbo:country dbr:Sweden }"
   },
   {
      "id": "96",
      "en_ques": "list all the musicals with music by leonard bernstein.",
      "en_key": "musicals, music by, leonard bernstein",
      "de_ques": "liste alle musicals mit musik von leonard bernstein auf.",
      "de_key": "musicals, musik von, leonard bernstein",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Musical> ; <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Leonard_Bernstein> }",
      "entities": [
         "Leonard_Bernstein"
      ],
      "relations": [
         "Musical",
         "musicBy"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Musical ; dbo:musicBy dbr:Leonard_Bernstein }"
   },
   {
      "id": "97",
      "en_ques": "give me all companies in the advertising industry.",
      "en_key": "company, advertising industry",
      "de_ques": "gib mir alle unternehmen, die in der werbebranche t\u00e4tig sind.",
      "de_key": "unternehmen, werbebranche",
      "sparql": "SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a <http://dbpedia.org/ontology/Company> { ?uri <http://dbpedia.org/ontology/industry> <http://dbpedia.org/resource/Advertising> } UNION { ?uri <http://dbpedia.org/ontology/industry> ?industry FILTER regex(?industry, 'advertising', 'i') } }",
      "entities": [
         "Advertising"
      ],
      "relations": [
         "Company",
         "industry",
         "industry"
      ],
      "fil_sparql": "SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a dbo:Company { ?uri dbo:industry dbr:Advertising } UNION { ?uri dbo:industry ?industry FILTER regex(?industry, 'advertising', 'i') } }"
   },
   {
      "id": "101",
      "en_ques": "give me all australian metalcore bands.",
      "en_key": "australian, metalcore bands",
      "de_ques": "gib mir alle australischen metalcore-bands.",
      "de_key": "australisch, metalcore-bands",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Band> ; <http://dbpedia.org/ontology/genre> <http://dbpedia.org/resource/Metalcore> { ?uri <http://dbpedia.org/ontology/hometown> <http://dbpedia.org/resource/Australia> } UNION { ?uri <http://dbpedia.org/ontology/hometown> ?h . ?h <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Australia> } }",
      "entities": [
         "Metalcore",
         "Australia",
         "Australia"
      ],
      "relations": [
         "Band",
         "genre",
         "hometown",
         "hometown",
         "country"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Band ; dbo:genre dbr:Metalcore { ?uri dbo:hometown dbr:Australia } UNION { ?uri dbo:hometown ?h . ?h dbo:country dbr:Australia } }"
   },
   {
      "id": "109",
      "en_ques": "give me all books written by danielle steel.",
      "en_key": "book, written, danielle steel",
      "de_ques": "gib mir alle b\u00fccher, die danielle steel geschrieben hat.",
      "de_key": "buch, schreiben, danielle steel",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Book> ; <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Danielle_Steel> }",
      "entities": [
         "Danielle_Steel"
      ],
      "relations": [
         "Book",
         "author"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Book ; dbo:author dbr:Danielle_Steel }"
   },
   {
      "id": "118",
      "en_ques": "give me all methodist politicians.",
      "en_key": "politician, methodist",
      "de_ques": "gib mir alle politiker, die methodisten sind.",
      "de_key": "politiker, methodist",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Politician> ; <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Methodism> }",
      "entities": [
         "Methodism"
      ],
      "relations": [
         "Politician",
         "religion"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Politician ; dbo:religion dbr:Methodism }"
   },
   {
      "id": "128",
      "en_ques": "give me all actors called baldwin.",
      "en_key": "actors, called, baldwin",
      "de_ques": "gib mir alle schauspieler, die baldwin hei\u00dfen.",
      "de_key": "schauspieler, hei\u00dfen, baldwin",
      "sparql": "PREFIX foaf:<http://xmlns.com/foaf/0.1/> SELECT DISTINCT ?uri WHERE { ?uri foaf:surname 'Baldwin'@en . { ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Actor> . } UNION { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Actor> . } }",
      "entities": [
         "Actor"
      ],
      "relations": [
         "occupation",
         "Actor",
         "surname"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri foaf:surname 'Baldwin'@en . { ?uri dbo:occupation dbr:Actor . } UNION { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Actor . } }"
   },
   {
      "id": "136",
      "en_ques": "show me all songs from bruce springsteen released between 1980 and 1990.",
      "en_key": "song, bruce springsteen, release, between 1980 and 1990",
      "de_ques": "zeige mir alle lieder von bruce springsteen, die zwischen 1980 und 1990 herausgebracht wurden.",
      "de_key": "lied, bruce springsteen, herausbringen, zwischen 1980 und 1990",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Song> . ?uri <http://dbpedia.org/ontology/artist> <http://dbpedia.org/resource/Bruce_Springsteen> . ?uri <http://dbpedia.org/ontology/releaseDate> ?date . FILTER (?date >= '1980-01-01'^^xsd:date && ?date <= '1990-12-31'^^xsd:date) }",
      "entities": [
         "Bruce_Springsteen"
      ],
      "relations": [
         "Song",
         "artist",
         "releaseDate"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Song . ?uri dbo:artist dbr:Bruce_Springsteen . ?uri dbo:releaseDate ?date . FILTER (?date = '1980-01-01'^^xsd:date && ?date <= '1990-12-31'^^xsd:date) }"
   },
   {
      "id": "141",
      "en_ques": "give me the birthdays of all actors of the television show charmed.",
      "en_key": "television show, charmed, actor, birthday",
      "de_ques": "gib mir die geburtstage von allen darstellern der fernsehserie charmed.",
      "de_key": "fernsehserie, charmed, darsteller, geburtstag",
      "sparql": "SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Charmed> <http://dbpedia.org/ontology/starring> ?actor . ?actor <http://dbpedia.org/ontology/birthDate> ?date }",
      "entities": [
         "Charmed"
      ],
      "relations": [
         "starring",
         "birthDate"
      ],
      "fil_sparql": "SELECT DISTINCT ?date WHERE { dbr:Charmed dbo:starring ?actor . ?actor dbo:birthDate ?date }"
   },
   {
      "id": "143",
      "en_ques": "give me a list of all lakes in denmark.",
      "en_key": "lake, denmark",
      "de_ques": "gib mir eine liste aller seen in d\u00e4nemark.",
      "de_key": "see, d\u00e4nemark",
      "sparql": "SELECT DISTINCT ?uri WHERE { { ?uri a <http://dbpedia.org/ontology/Lake> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark> } UNION { ?uri a <http://dbpedia.org/class/yago/LakesOfDenmark> } }",
      "entities": [
         "Denmark"
      ],
      "relations": [
         "Lake",
         "country",
         "LakesOfDenmark"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { { ?uri a dbo:Lake ; dbo:country dbr:Denmark } UNION { ?uri a yago:LakesOfDenmark } }"
   },
   {
      "id": "145",
      "en_ques": "show me all english gothic buildings in kent.",
      "en_key": "english gothic buildings, kent",
      "de_ques": "zeige mir alle geb\u00e4ude in kent, die im stil der englischen gothik erbaut wurden.",
      "de_key": "geb\u00e4ude, kent, englische gotik",
      "sparql": "SELECT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Building> ; <http://dbpedia.org/ontology/architecturalStyle> <http://dbpedia.org/resource/English_Gothic_architecture> ; <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Kent> }",
      "entities": [
         "English_Gothic_architecture",
         "Kent"
      ],
      "relations": [
         "Building",
         "architecturalStyle",
         "location"
      ],
      "fil_sparql": "SELECT ?uri WHERE { ?uri a dbo:Building ; dbo:architecturalStyle dbr:English_Gothic_architecture ; dbo:location dbr:Kent }"
   },
   {
      "id": "171",
      "en_ques": "give me all movies with tom cruise.",
      "en_key": "movie, tom cruise",
      "de_ques": "gib mir alle filme mit tom cruise.",
      "de_key": "film, tom cruise",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Tom_Cruise> }",
      "entities": [
         "Tom_Cruise"
      ],
      "relations": [
         "Film",
         "starring"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Film ; dbo:starring dbr:Tom_Cruise }"
   },
   {
      "id": "175",
      "en_ques": "give me all b-sides of the ramones.",
      "en_key": "ramones, b-sides",
      "de_ques": "gib mir alle b-seiten der ramones.",
      "de_key": "ramones, b-seiten",
      "sparql": "SELECT DISTINCT ?string WHERE { ?x <http://dbpedia.org/ontology/musicalArtist> <http://dbpedia.org/resource/Ramones> ; <http://dbpedia.org/ontology/bSide> ?string }",
      "entities": [
         "Ramones"
      ],
      "relations": [
         "musicalArtist",
         "bSide"
      ],
      "fil_sparql": "SELECT DISTINCT ?string WHERE { ?x dbo:musicalArtist dbr:Ramones ; dbo:bSide ?string }"
   },
   {
      "id": "178",
      "en_ques": "list the seven kings of rome.",
      "en_key": "kings, rome",
      "de_ques": "gib mir eine liste aller k\u00f6nige von rom.",
      "de_key": "k\u00f6nige, rom",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/title> <http://dbpedia.org/resource/King_of_Rome> }",
      "entities": [
         "King_of_Rome"
      ],
      "relations": [
         "title"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri dbp:title dbr:King_of_Rome }"
   },
   {
      "id": "179",
      "en_ques": "give me all people that were born in vienna and died in berlin.",
      "en_key": "people, born, vienna, die, berlin",
      "de_ques": "gib mir alle personen, die in wien geboren wurden und in berlin gestorben sind.",
      "de_key": "person, geboren, wien, gestorben, berlin",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Vienna> ; <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Berlin> }",
      "entities": [
         "Vienna",
         "Berlin"
      ],
      "relations": [
         "birthPlace",
         "deathPlace"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri dbo:birthPlace dbr:Vienna ; dbo:deathPlace dbr:Berlin }"
   },
   {
      "id": "181",
      "en_ques": "show me all the breweries in australia.",
      "en_key": "breweries, australia",
      "de_ques": "zeig mir alle brauereien in australien.",
      "de_key": "brauereien, australien",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Brewery> { ?uri <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Australia> } UNION { ?uri <http://dbpedia.org/ontology/location> ?x . ?x <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Australia> } }",
      "entities": [
         "Australia",
         "Australia"
      ],
      "relations": [
         "Brewery",
         "location",
         "location",
         "country"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:Brewery { ?uri dbo:location dbr:Australia } UNION { ?uri dbo:location ?x . ?x dbo:country dbr:Australia } }"
   },
   {
      "id": "182",
      "en_ques": "give me all films produced by steven spielberg with a budget of at least $80 million.",
      "en_key": "films, producer, steven spielberg, production budget, $80 million",
      "de_ques": "gib mir alle filme, die von steven spielberg produziert wurden und ein budget von mindestens 80 millionen dollar hatten.",
      "de_key": "film, produzent, steven spielberg, budget, $80 millionen",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> . ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Steven_Spielberg> . ?uri <http://dbpedia.org/ontology/budget> ?b . FILTER( xsd:double(?b) >= 8.0E7 ) }",
      "entities": [
         "Steven_Spielberg"
      ],
      "relations": [
         "Film",
         "director",
         "budget"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type dbo:Film . ?uri dbo:director dbr:Steven_Spielberg . ?uri dbo:budget ?b . FILTER( xsd:double(?b) = 8.0E7 ) }"
   },
   {
      "id": "183",
      "en_ques": "give me all soccer clubs in spain.",
      "en_key": "spain, soccer club",
      "de_ques": "gib mir alle fu\u00dfballvereine in spanien.",
      "de_key": "fu\u00dfballverein, spanien",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> { ?uri <http://dbpedia.org/ontology/ground> <http://dbpedia.org/resource/Spain> } UNION { ?uri <http://dbpedia.org/property/ground> ?ground FILTER regex(?ground, 'Spain') } }",
      "entities": [
         "Spain"
      ],
      "relations": [
         "SoccerClub",
         "ground",
         "ground"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri a dbo:SoccerClub { ?uri dbo:ground dbr:Spain } UNION { ?uri dbp:ground ?ground FILTER regex(?ground, 'Spain') } }"
   },
   {
      "id": "185",
      "en_ques": "give me all breeds of the german shepherd dog.",
      "en_key": "breed, german shepherd dog",
      "de_ques": "gib mir alle sch\u00e4ferhundrassen.",
      "de_key": "sch\u00e4ferhundrasse",
      "sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd> }",
      "entities": [
         "German_Shepherd"
      ],
      "relations": [
         "breed"
      ],
      "fil_sparql": "SELECT DISTINCT ?uri WHERE { ?uri dbp:breed dbr:German_Shepherd }"
   }
]